[
  {
    "Name": "OpenInfra Days North America Keynotes",
    "Description": "Infrastructure lays the foundation for every daily function and open source drives innovation, cost savings, and adaptability. Together, open infrastructure has adapted to global and regional trends to disrupt proprietary market holds and drive human progress. In the face of recent trends, like licensing changes and redefining infrastructure for AI, open source communities are continuing to collaborate to evolve the projects behind an $8.8 trillion USD market.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T09:00:00-08:00",
    "EndTime": "2025-03-06T10:15:00-08:00",
    "Speakers": "Allison Price, Gerald Bothello, Luke Repko, Chris Breu, Julia Kreger, James Blair, Ildiko Vancsa",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Fireside Chat: An Outsider’s Look at Nix",
    "Description": "We’ve all heard the usual insider talks about Nix. This session flips the script. Ron Efroni will lead a candid fireside chat with Kelsey Hightower, known for his pioneering work on Kubernetes, as we dive into his journey discovering Nix. Expect blunt takes on where Nix gets it right, where it needs a reality check, and what lessons from container orchestration might apply. If you’re curious about the raw, unfiltered truth of Nix’s present and future, don’t miss it.",
    "Location": "Room 101",
    "StartTime": "2025-03-06T09:30:00-08:00",
    "EndTime": "2025-03-06T10:00:00-08:00",
    "Speakers": "Ron Efroni, Kelsey Hightower",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Embedded Programming Workshop Day 1",
    "Description": "Day 1 of a a two day class on embedded programming. We will be programming a STM Arm chip with no operating system. This will be bare metal programming. Topics include what the compiler does behind the scenes, I/O direct to the hardware, memory layout, reading assembly, and interrupt programming. Pre-registration (in addition to your conference registration) is required.",
    "Location": "Room 209",
    "StartTime": "2025-03-06T10:00:00-08:00",
    "EndTime": "2025-03-06T17:00:00-08:00",
    "Speakers": "Steve Oualline",
    "Topic": "Workshops"
  },
  {
    "Name": "A look at the Elephant's trunk - PostgreSQL 18",
    "Description": "PostgreSQL 18 is almost at feature freeze, and at this point we have at least some ideas of what features will be included. This talk will take a quick look at what's in there already, and what's in the queue for the next major release!",
    "Location": "Ballroom G",
    "StartTime": "2025-03-06T10:00:00-08:00",
    "EndTime": "2025-03-06T11:00:00-08:00",
    "Speakers": "Magnus Hagander",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "Kubernetes For Sysadmins Workshop",
    "Description": "If you're an experienced sysadmin but a Kubernetes novice, trying to understand how Kubernetes does things, this workshop will show you how to use traditional Linux tools you probably already know to understand Kubernetes today -- from the basic Kubernetes components themselves to higher-level workload concepts like service discovery.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-06T10:00:00-08:00",
    "EndTime": "2025-03-06T13:00:00-08:00",
    "Speakers": "Joe Thompson",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Power Editing with vi",
    "Description": "This hands-on tutorial will take you from a vi beginner or intermediate user to a Power User, able to leap tall text buildings with a single bound. Unleash the full power of that blinking cursor, become more efficient at your job, and fame and fortune will surely follow. Most people use only 10% of what vi is fully capable of. Awaken to your vi’s full potential. Target audience: Anybody who has to edit files on UNIX-like systems. A sysadmin who’s been using vi for 18 years come up to me afterward and said he learned something useful. Requirements: A laptop with vi.",
    "Location": "Room 208",
    "StartTime": "2025-03-06T10:00:00-08:00",
    "EndTime": "2025-03-06T13:00:00-08:00",
    "Speakers": "Aleksey Tsalolikhin",
    "Topic": "Workshops"
  },
  {
    "Name": "Open Source for Good",
    "Description": "Join us for a hands-on \"Open Source for Good\" workshop where participants of all skill levels will contribute to real-world social impact projects. Working alongside nonprofit leaders, you'll learn contribution workflows while making meaningful improvements to vetted projects. From beginner-friendly documentation updates to advanced feature implementation, you'll gain practical experience with GitHub tooling and collaborative development practices.",
    "Location": "Room 211",
    "StartTime": "2025-03-06T10:00:00-08:00",
    "EndTime": "2025-03-06T13:00:00-08:00",
    "Speakers": "Cynthia Lo, Avni Khatri, Margaret Tucker, Adam Holt, Rachel Stanik",
    "Topic": "Workshops"
  },
  {
    "Name": "Progressive Delivery with Argo Rollouts",
    "Description": "In this hands-on workshop attendees will learn the basics of how to use Argo Rollouts to progressively roll out apps. In this lab you will learn how to: * Review the Rollouts specification * Use Rollouts to perform a blue-green deployment * Update the image with continuous integration and observe the blue-green progressive delivery in action * Enhance the blue-green rollout with integrated testing by applying an AnalysisTemplate * Update the image again and review how the AnalysisTemplate works * Use Rollouts to perform a canary deployment with progressive delivery",
    "Location": "Ballroom B",
    "StartTime": "2025-03-06T10:00:00-08:00",
    "EndTime": "2025-03-06T13:00:00-08:00",
    "Speakers": "Ryan Jarvinen, Evan Shortiss, Christian Hernandez",
    "Topic": "Cloud Native"
  },
  {
    "Name": "The Nix PR Pipeline",
    "Description": "A detailed explanation of how pull requests are staged and trickle into the different channels in Nixpkgs and NixOS.",
    "Location": "Room 101",
    "StartTime": "2025-03-06T10:00:00-08:00",
    "EndTime": "2025-03-06T10:30:00-08:00",
    "Speakers": "Tristan Ross",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Learn Nix the Fun Way",
    "Description": "Learning Nix can be off-putting, as many introductions dive into complex terminology and academic concepts, missing the chance to simplify Nix's advantages. Having given talks both internally and externally, I've shifted to showcasing fun, practical examples first, leaving the nuances for later. Join me to see some straightforward examples of what Nix can offer and why it might be worth adopting.",
    "Location": "Room 104",
    "StartTime": "2025-03-06T10:00:00-08:00",
    "EndTime": "2025-03-06T10:30:00-08:00",
    "Speakers": "Farid Zakaria",
    "Topic": "PlanetNix"
  },
  {
    "Name": "pAI-OS Workshop",
    "Description": "​Get hands-on experience with pAI-OS, an innovative open-source platform designed to empower developers and researchers in the AI community. This interactive workshop offers a comprehensive introduction to the pAI-OS ecosystem, guiding participants through its core functionalities and contribution opportunities. ​During this 105-minute session, you'll dive deep into the pAI-OS codebase, learning essential concepts and practical implementation techniques.",
    "Location": "Room 212",
    "StartTime": "2025-03-06T10:00:00-08:00",
    "EndTime": "2025-03-06T11:45:00-08:00",
    "Speakers": "Sam Johnston",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "SunSecCon Workshop: Cooking Cyber Recipes with CyberChef",
    "Description": "CyberChef is known as the “The Cyber Swiss Army Knife” and is a simple, intuitive web app for carrying out all “cyber” operations within a web browser. The tool enables technical and non-technical analysts to manipulate data in complex ways without dealing with complex tools or algorithms.",
    "Location": "Room 105",
    "StartTime": "2025-03-06T10:00:00-08:00",
    "EndTime": "2025-03-06T12:00:00-08:00",
    "Speakers": "Marco Palacios",
    "Topic": "SunSecCon"
  },
  {
    "Name": "Getting Started With OpenStack",
    "Description": "Learn more about OpenStack as a whole, the different services and how to get involved.",
    "Location": "Room 107",
    "StartTime": "2025-03-06T11:00:00-08:00",
    "EndTime": "2025-03-06T11:30:00-08:00",
    "Speakers": "Amy Marrich",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Students in Open Source: The OpenInfra University Partnership Program Growth and Lessons Learned",
    "Description": "The audience will learn about the collaboration the OpenInfra Foundation has fostered with universities to get students involved in Open Source before graduation. After reaching over 100 students, we have learned a lot and are eager to share improvements and plans for the future.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T11:00:00-08:00",
    "EndTime": "2025-03-06T11:30:00-08:00",
    "Speakers": "Kendall Nelson, Stephen Walli, Corey Leong",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Docker Was Too Slow, So We Replaced It: Nix in Production",
    "Description": "Kubernetes means containers - but container images stop scaling once you hit 25+ GB, even if you’re building them with Nix. Learn how Anthropic took production startup times from minutes to sub-second with a multi-level, replicated cache hierarchy. We’ll deep dive into nix-sidecar: our custom tool to escape Docker, replacing slow image pulls with highly-parallel native Nix fetches, cached on every node. This talk is for anyone interested in faster deploys or advanced Nix usage!",
    "Location": "Room 101",
    "StartTime": "2025-03-06T11:00:00-08:00",
    "EndTime": "2025-03-06T11:30:00-08:00",
    "Speakers": "Aneesh Agrawal",
    "Topic": "PlanetNix"
  },
  {
    "Name": "generating secrets with nixos, the missing puzzle piece",
    "Description": "There are a lot of different secret management technologies around nixos, like sops-nix, agenix, etc. All of them still require to manually generate and encrypt secrets though. So we are happy to announce the missing piece to have full declarative services with zero user interaction: NixOS vars (name will maybe change :))",
    "Location": "Room 104",
    "StartTime": "2025-03-06T11:00:00-08:00",
    "EndTime": "2025-03-06T11:30:00-08:00",
    "Speakers": "Kenji Berthold, Lassulus .",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Language is a Virus: Locales and PostgreSQL",
    "Description": "Language is a Virus: Locales and PostgreSQL This is a pragmatic look at PostgreSQL's support for locales, in particular around character encoding and collations. This is intended for DBAs and developers who want to make use of PostgreSQL's extensive locale features with a minimum number of gotchas. Among the topics are: * A quick overview of locales, character encodings, and collations. * What a \"locale provider,\" and how do you use it? * How do various collations perform? * What are the use cases for various locales? * And what is this horrible thing about index corruption I hear ab",
    "Location": "Ballroom G",
    "StartTime": "2025-03-06T11:15:00-08:00",
    "EndTime": "2025-03-06T12:15:00-08:00",
    "Speakers": "Christophe Pettus",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "OpenStack in the Real World",
    "Description": "A fully integrated OpenStack cluster, especially one utilizing Ironic or Neutron, touches all parts of an environment. Tight integration like this comes with a price: almost any issue in your environment may be surfaced as a failure or error to an end user. In this session, we will discuss how to properly monitor your OpenStack cluster, separating real-world failures from software bugs as well as how to market your cloud engineering work to nontechnical parts of the business.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T11:30:00-08:00",
    "EndTime": "2025-03-06T12:00:00-08:00",
    "Speakers": "Jay Faulkner",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Building and Supporting Open Source Communities Through Metrics: Reviewing OpenInfra Community Metrics",
    "Description": "In this talk, we will explore what metrics are available to look at communities. By leveraging these metrics, participants will gain insights into community health, engagement levels, and the overall effectiveness of support strategies. Join us to discover how data-driven approaches can enhance our efforts in building and sustaining vibrant open-source ecosystems. We will take a look at metrics from the OpenInfra communities and have an open conversation with the audience about what we’re seeing. We will field questions live and dive into the data together.",
    "Location": "Room 107",
    "StartTime": "2025-03-06T11:30:00-08:00",
    "EndTime": "2025-03-06T12:00:00-08:00",
    "Speakers": "Georg Link",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Building Linux from Scratch... from Nix",
    "Description": "Nix is a powerful build system that enhances and simplifies software development workflows. 'Linux from Scratch' is a well-known guide to building a customized Linux operating system from source, designed for gaining a deeper understanding Linux system internals. In this talk, we will share the journey of using Nix to build Linux from Scratch, as well as the challenges faced, insights gained, and epiphanies discovered along the way.",
    "Location": "Room 104",
    "StartTime": "2025-03-06T11:30:00-08:00",
    "EndTime": "2025-03-06T12:00:00-08:00",
    "Speakers": "Tim Golden",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Remote Nix Builds",
    "Description": "Nix has builtin support for distributing builds to remote machines. In fact, any SSH-accessible computer with a Nix installation can be used as a build server! In this talk, I'll give an overview on how remote Nix builds work in practice, and talk about their possibilities and limitations. I'll also lift the lid on Nix and show how the remote builder protocol works. Finally I'll mention some improvements I'd like to see in Nix, based on my experience on implementing the nixbuild.net service.",
    "Location": "Room 101",
    "StartTime": "2025-03-06T11:30:00-08:00",
    "EndTime": "2025-03-06T12:00:00-08:00",
    "Speakers": "Rickard Nilsson",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Knowing is Half the Battle: End to End Observability in OpenStack on Kubernetes",
    "Description": "Running OpenStack on Kubernetes is a great idea for many reasons, but there is one very large drawback: when something goes wrong on Day 2, how do you find it? In this talk, we will explain our approach to a rather complex Observability problem using both OpenStack Services and Cloud Native Observability tools.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T12:00:00-08:00",
    "EndTime": "2025-03-06T12:30:00-08:00",
    "Speakers": "Jamie Parker",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Project Gating with Zuul",
    "Description": "Zuul is a project gating system, which is like a CI/CD system that is primarily focused on ensuring multiple changes are well-tested with each other before being merged. Learn what makes Zuul unique, how it's used in Open Source projects like OpenStack as well as in the enterprise, and how you can get started using it to stop merging broken code.",
    "Location": "Room 107",
    "StartTime": "2025-03-06T12:00:00-08:00",
    "EndTime": "2025-03-06T12:30:00-08:00",
    "Speakers": "James Blair",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Welcome to Kwaai Summit",
    "Description": "Matt and Reza will welcome you to the Kwaai Summit and introduce you to Peronsal AI",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T12:00:00-08:00",
    "EndTime": "2025-03-06T12:15:00-08:00",
    "Speakers": "Matthew Small, Reza Rassool",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "AI in Education: Amplified Intelligence through Games",
    "Description": "Artificial intelligence and game-based learning are converging and transforming education by making learning more efficient, personalized, and engaging. This talk will discuss how AI-driven adaptive learning systems can improve knowledge retention and problem-solving by tailoring content to individual learners. Drawing from his vast and storied experience in both video games and educational technology, Bushnell will explain how gamification, real-time feedback, and AI-driven pattern recognition enhance learning outcomes.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T12:15:00-08:00",
    "EndTime": "2025-03-06T12:45:00-08:00",
    "Speakers": "Nolan Bushnell",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Ironic, Neutron and OVN - current challenges",
    "Description": "This talk will highlight the ongoing challenges with implementing OpenStack Neutron ML2/OVN and Ironic/SR-IOV external ports.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T12:30:00-08:00",
    "EndTime": "2025-03-06T13:00:00-08:00",
    "Speakers": "Michal Nasiadka, Bartosz Bezak",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Bringing MongoDB workloads back to open source by using FerretDB to store data on PostgreSQL",
    "Description": "Introduction to fully open source alternative for MongoDB. Show how easily you can replace expensive and vendor-locked-in MongoDB services using PostgreSQL in the Kubernetes cluster + FerretDB.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-06T12:30:00-08:00",
    "EndTime": "2025-03-06T13:30:00-08:00",
    "Speakers": "Peter Farkas",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "Testing software defined storage on multiple architectures in a OpenStack environment",
    "Description": "While x86 servers certianly dominate the landscape in datacenters, they are not the only option for running an OpenStack environment.&nbsp; We'll discuss some options for installation, and then examine the concrete example of how a dual architecture enivornment works in the IBM Storage Scale lab.",
    "Location": "Room 107",
    "StartTime": "2025-03-06T12:30:00-08:00",
    "EndTime": "2025-03-06T13:00:00-08:00",
    "Speakers": "olaph wagoner",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Trust in AI - Beware of Double Agents",
    "Description": "Trusting a friend and trusting a service are fundamentally different. The former is personal and intimate, while the latter is impersonal and can scale to all of human society. The companies behind the current generative AI systems are poised to exploit that difference. Their intimate conversational nature will cause us to think of them as friends when they are actually services, and trusted confidants when they will actually be working against us. Like much of the internet, these systems will collect our personal data behind our backs and try to manipulate our behavior.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T12:45:00-08:00",
    "EndTime": "2025-03-06T13:00:00-08:00",
    "Speakers": "Bruce Schneier",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "The 5th Element: Operationalizing the Agentic Economy",
    "Description": "This talk explores the transition to conscious, dynamic systems and business models in the era of intelligence. By rethinking how workflows, compute, and context flow seamlessly, we move beyond the band-aid approach of containerized apps forced to orchestrate. Instead, we embrace dynamic, natural, adaptive continuums that form the foundation for equitable, scalable, and sustainable agentic ecosystems. Highlighting the diversity of AI, expanding beyond LLM-generated responses from a single vendor to a butterfly effect triggered by events that transcend the physical world.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T13:00:00-08:00",
    "EndTime": "2025-03-06T13:15:00-08:00",
    "Speakers": "Fay Arjomandi",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "SunSecCon Workshop: Kubernetes Security - Hands-On Attack and Defense",
    "Description": "Kubernetes is the de facto operating system of the cloud, and more and more organizations are running their workloads on Kubernetes. While Kubernetes offers many benefits, new users may introduce security risks like cluster misconfiguration, leaked credentials, cryptojacking, container escapes, and vulnerable clusters. This workshop will teach you the fundamentals of Kubernetes security, from protecting your cluster to securing your workloads.",
    "Location": "Room 105",
    "StartTime": "2025-03-06T13:00:00-08:00",
    "EndTime": "2025-03-06T15:00:00-08:00",
    "Speakers": "Lenin Alevski",
    "Topic": "SunSecCon"
  },
  {
    "Name": "Personal vs. Personalized AI",
    "Description": "Your AI should be as personal as your pants, your car, and your PC. It should be yours and not a suction-cup on the tentacle of a corporate giant. We don't have that yet, but we will, And when we get it, the greenfield will be infinitely large—unless we settle for the personalized kind. Doc will explain the difference and how we can make sure personal AI wins.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T13:15:00-08:00",
    "EndTime": "2025-03-06T13:30:00-08:00",
    "Speakers": "Doc Searls",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Fedora+CentOS Classroom",
    "Description": "Learn about the ecosystems in the Fedora and CentOS projects, and how you can package software for both. We will present an overview of the Fedora project followed by an overview CentOS ecosystem. We'll show how both systems are developed and what the various special interest groups are doing. We will then provide a packaging workshop where you can learn how to package your favorite software, whether you want it in Fedora, EPEL, a CentOS SIG, or just for your own personal use.",
    "Location": "Room 208",
    "StartTime": "2025-03-06T14:00:00-08:00",
    "EndTime": "2025-03-06T17:00:00-08:00",
    "Speakers": "Carl George, Shaun McCance, Jason Brooks",
    "Topic": "Workshops"
  },
  {
    "Name": "bpftrace hands on lab",
    "Description": "bpftrace is a popular high-level tracing language and CLI tool for Linux systems with a growing user base and an active development community (bpftrace.org). This session will be a practical, hands-on exploration of bpftrace. No former knowledge of bpftrace required. Maintainers will guide you through the key areas of the technology in a series of carefully designed mini-tutorials and corresponding exercises.",
    "Location": "Room 211",
    "StartTime": "2025-03-06T14:00:00-08:00",
    "EndTime": "2025-03-06T17:00:00-08:00",
    "Speakers": "Jonathan Haslam, Jordan Rome, Daniel Xu",
    "Topic": "Workshops"
  },
  {
    "Name": "So you want to be a Kubestronaut",
    "Description": "Dive into the world of Kubernetes and discover the path to becoming a Kubestronaut. This workshop covers the journey from beginner to expert, including exam prep strategies and setting up a local environment for hands-on practice. Learn how to overcome common challenges and stay motivated on your way to achieving Kubestronaut status.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-06T14:00:00-08:00",
    "EndTime": "2025-03-06T17:00:00-08:00",
    "Speakers": "Paul Yu",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Developing as a Team for Kubernetes with Nix and Flox",
    "Description": "In this workshop, Leigh, Tanja, and Nick will show a GitOps workflow for both your team's laptops and Kubernetes clusters.We'll cover the basics of Nix and Flox, a collaborative interface for using Nix as a team.Attendees will work together in the hands-on portion to:- bootstrap a frontend and backend project with Javascript, Go, and Postgres- declare cross-platform tools and dependencies for build and development- containerize their build in a Nix-native way- use GitOps via Flux to promote their service to Kubernetes clusters with zero-downtime deploys",
    "Location": "Ballroom B",
    "StartTime": "2025-03-06T14:00:00-08:00",
    "EndTime": "2025-03-06T17:00:00-08:00",
    "Speakers": "Leigh Capili, Tanja Ulianova, Nick Lewis",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Nix in the Wild",
    "Description": "Nix in the Wild is a series where we interview users of Nix and ask them about their journey. We want to know about the good moments and the bad, and we want to tell it like it is. What makes users choose Nix? How long does it take for them to get their colleagues onboard? What do they learn along the way? In this quick talk, Ross from Flox will go over a few of the most amazing stories from Nix in the Wild (rawr!)...and let you know how we can help you tell yours.",
    "Location": "Room 101",
    "StartTime": "2025-03-06T14:00:00-08:00",
    "EndTime": "2025-03-06T14:30:00-08:00",
    "Speakers": "Ross Turk",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Introduction to the Module System",
    "Description": "Curious about the Nix module system but don’t know where to start? This talk introduces the core concepts and basics of the Nix module system, designed for those new to Nix. We’ll break down how it works, why it’s so powerful for declarative configuration, and how you can start using it for your own projects. No prior experience is required—just a willingness to explore and learn!",
    "Location": "Room 104",
    "StartTime": "2025-03-06T14:00:00-08:00",
    "EndTime": "2025-03-06T15:30:00-08:00",
    "Speakers": "Daniel Baker",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Panel: AI Thought Leaders",
    "Description": "Recap the mornings learnings with a panel of AI thought leaders.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T14:00:00-08:00",
    "EndTime": "2025-03-06T14:30:00-08:00",
    "Speakers": "Doc Searls, Fay Arjomandi, Reza Rassool, Nolan Bushnell",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Extend your PostgreSQL: The world of PostgreSQL extensions",
    "Description": "This talk will mention about the world of extensions of PostgreSQL.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-06T14:30:00-08:00",
    "EndTime": "2025-03-06T15:30:00-08:00",
    "Speakers": "Devrim Gunduz",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "RDO openstack on OKD kubernetes: The perfect combination for modern enterprise datacenter",
    "Description": "Running RDO openstack on OKD kubernetes offers enterprises a unified, scalable solution that combines robust cloud infrastructure with efficient container orchestration, ideal for handling both cloud-native and legacy applications. This presentation highlights key benefits, deployment strategies, and best practices to optimize datacenter operations and enhance resource flexibility.",
    "Location": "Room 107",
    "StartTime": "2025-03-06T14:30:00-08:00",
    "EndTime": "2025-03-06T15:00:00-08:00",
    "Speakers": "Maciej Lecki",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "CephFS and OpenStack Manila: File Sharing Without the Headaches (Mostly!)",
    "Description": "Explore the evolving integration of CephFS with OpenStack Manila in this session, where we’ll delve into the unique features CephFS brings to cloud file systems. We’ll cover the trade-offs of CephFS Native and CephFS NFS, highlighting practical reasons why each might not fit all use cases. Wrapping up, we’ll look at future innovations, like the SMB driver and VirtIOFS, that promise to expand functionality and use cases for OpenStack file sharing. Join us for a deep dive into these powerful tools and their future in cloud architecture.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T14:30:00-08:00",
    "EndTime": "2025-03-06T15:00:00-08:00",
    "Speakers": "Goutham Pacha Ravi, Carlos Eduardo da Silva, Ashley Rodriguez",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Using /opt/store",
    "Description": "Exploring the pros-cons of a non-/nix prefix.",
    "Location": "Room 101",
    "StartTime": "2025-03-06T14:30:00-08:00",
    "EndTime": "2025-03-06T15:00:00-08:00",
    "Speakers": "Thomas Bereknyei",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Companion Intelligence: Powered by your Digital Memory",
    "Description": "The ability to retain, understand, and act on personal data is key to building truly intelligent assistants. In this talk, Liam Broza introduces Companion Intelligence, a platform that leverages Digital Memory to give users control over their data while enabling AI-powered deep personalization and contextual awareness. He will explore the evolution of Companion Intelligence, its role in shaping embodied AI agents, and provide a demo of how these systems can enhance productivity, security, and autonomy in the digital world.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T14:30:00-08:00",
    "EndTime": "2025-03-06T14:45:00-08:00",
    "Speakers": "Liam Broza",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Kwaai Personal AI Assistant Vision and Roadmap",
    "Description": "Greg will discuss the challenges of building an open-source AI ecosystem, the importance of privacy and autonomy in AI design, and the key milestones ahead. Attendees will gain insight into how Kwaai is redefining AI ownership, empowering individuals to control their data while leveraging AI’s full potential. The session will also explore opportunities for developers, contributors, and organizations to participate in shaping the future of personal AI.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T14:45:00-08:00",
    "EndTime": "2025-03-06T15:00:00-08:00",
    "Speakers": "Greg Spektor",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Kata Containers - Security and Containers Without Compromise",
    "Description": "Get a technology overview of how Kata Containers, an open source, secure container runtime project, utilizes virtualization technology to overcome the biggest gap in traditional containers, the lack of isolation. The project is running in production in large public clouds, financial institutions, and being utilized for machine learning use cases to ensure data privacy. For an additional layer of protection Kata can be integrated with the Confidential Containers (CoCo) project, which brings confidential computing mechanisms into the container space.",
    "Location": "Room 107",
    "StartTime": "2025-03-06T15:00:00-08:00",
    "EndTime": "2025-03-06T15:30:00-08:00",
    "Speakers": "Ildiko Vancsa",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Scaling AI with Open Source: Running Models on CPUs and GPUs in VMs on OpenStack",
    "Description": "Unlock open-source AI with OpenStack's scalable environment. Join Todd Robinson to explore running AI models on CPU/GPU in VMs, optimize resource allocation, and scale infrastructure. Discover real-world insights and see how hosted OpenStack boosts performance, security, and cost control. Whether you're a data scientist or infrastructure manager, gain practical knowledge to build a robust AI-ready environment with OpenStack.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T15:00:00-08:00",
    "EndTime": "2025-03-06T15:30:00-08:00",
    "Speakers": "Todd Robinson",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "pAI Hackathon for Emergency Preparedness, Response, and Recovery",
    "Description": "Jon will highlight the work of the Personal AI Hackathon focused on emergency response and fire resilience, where pAI can assist in real-time decision-making, disaster communication, and situational awareness. Leveraging offline-capable, distributed AI, first responders and affected communities can access critical information and coordination tools without being overly reliant on fragile infrastructure services.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T15:00:00-08:00",
    "EndTime": "2025-03-06T15:15:00-08:00",
    "Speakers": "Jon Conners",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Panel: Personal AI Technology",
    "Description": "Join our Personal AI Technology experts and for Q&A.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T15:15:00-08:00",
    "EndTime": "2025-03-06T15:30:00-08:00",
    "Speakers": "",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Kata Container & LLM",
    "Description": "This session introduce a Dashboard-AI architecture running on Kata container The platform is powered by LLM image to provide services such as data analysis, data forecast and dashboard generation Usage of kata container allows us to scale and monitor a cluster of secured images",
    "Location": "Room 107",
    "StartTime": "2025-03-06T15:30:00-08:00",
    "EndTime": "2025-03-06T16:00:00-08:00",
    "Speakers": "Patrick BEAUCAMP",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Charming wild snakes with pyproject.nix & uv2nix",
    "Description": "Pip, Conda, Poetry, and now, the Rust-based Uv. Python is a complex ecosystem fraught with pitfalls, fragmentation & historic legacy. Nix provides a unifying way to deal with complex software environments. However, language integration tooling for Python has been lacking. In this talk we'll explore pyproject.nix & uv2nix to wrangle everything from simple projects using requirements.txt & pyproject.toml to complex applications and monorepos.",
    "Location": "Room 101",
    "StartTime": "2025-03-06T15:30:00-08:00",
    "EndTime": "2025-03-06T16:00:00-08:00",
    "Speakers": "Adis Bladis",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Mastering NixOS Integration Tests: Advanced Techniques for Fast and Robust Multi-VM Tests",
    "Description": "Join this hands-on workshop to explore the powerful NixOS Integration Test Driver! In just two hours, learn to simulate complex networked environments with multiple hosts and virtual networks, use the interactive mode for debugging, and apply best practices to avoid flaky tests. Perfect for enhancing your NixOS testing skills and streamlining CI/CD pipelines. Don’t miss this chance to boost your expertise with reliable, real-world testing techniques!",
    "Location": "Room 104",
    "StartTime": "2025-03-06T15:30:00-08:00",
    "EndTime": "2025-03-06T18:00:00-08:00",
    "Speakers": "Jacek Galowicz",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Sponsor Talk: Optimizing Your Platform Architecture for VMs in OpenStack and OpenShift",
    "Description": "This session will illustrate how to optimize your data platform for performance, scalability, flexibility, and reliability in OpenStack and OpenShift environments.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T15:30:00-08:00",
    "EndTime": "2025-03-06T15:45:00-08:00",
    "Speakers": "Sagy Volkov",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Graph/RAG Frameworks for Accurate Drug Side Effect Retrieval in Large Language Models",
    "Description": "Drug side effects are a leading cause of morbidity and mortality worldwide, highlighting the need for improved detection and analysis methods. Large language models (LLMs) have emerged as powerful tools for generating human-like text. Yet, their knowledge is limited by black-box training data, they are prone to hallucinations, and they often lack domain-specific knowledge. Here, we propose two architectures integrating domain knowledge about drug side effects into a Llama 3-8B Language Model through Retrieval Augmented Generation (RAG) and GraphRAG.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T15:30:00-08:00",
    "EndTime": "2025-03-06T15:45:00-08:00",
    "Speakers": "Diego Galeano",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Keeping Your PostgreSQL Replication Healthy: Resolving Conflicts for Optimal Performance",
    "Description": "Replication conflicts can disrupt the consistency and reliability of a PostgreSQL database, especially in high-demand environments. This talk focuses on practical steps for monitoring, detecting, and resolving common replication conflicts.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-06T15:45:00-08:00",
    "EndTime": "2025-03-06T16:45:00-08:00",
    "Speakers": "Hamid Akhtar",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "Making AI Faster with State Space Models",
    "Description": "State Space Models (SSMs) are emerging as a powerful alternative to the transformer-based architectures that dominate today's language models, offering greater efficiency and scalability for modern AI applications. This talk explores how SSMs are transforming AI by reducing computational overhead while maintaining strong performance. Attendees will gain insights into the fundamental principles of state space models, their real-world applications, and the cutting-edge research being conducted at Kwaai to further enhance their capabilities.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T15:45:00-08:00",
    "EndTime": "2025-03-06T16:00:00-08:00",
    "Speakers": "",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Sponsor Talk: Pure Storage: Your OpenStack Storage Solution",
    "Description": "Discover how Pure Storage integrates into the OpenStack ecosystem and why it stands out as the ideal storage solution for OpenStack deployments.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T15:45:00-08:00",
    "EndTime": "2025-03-06T16:00:00-08:00",
    "Speakers": "Simon Dodsley",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Nix is faster than no evaluation",
    "Description": "Evaluating packages with big dependency trees with nix is time consuming. Currently, while there is a local eval cache, evaluation costs are sum up locally but also globally as eval caches are generally not shared across machine or user boundaries. In other places such as searching packages, evaluation is impossible, prohibitively expensive, or just annoying. In this talk I want to introduce different approaches to avoid evaluations, how they are motivated and what their limits are.",
    "Location": "Room 101",
    "StartTime": "2025-03-06T16:00:00-08:00",
    "EndTime": "2025-03-06T16:30:00-08:00",
    "Speakers": "Yannik Sander",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Technical Learnings of Building Distributed and Decentralized AI",
    "Description": "AI systems created and maintained by open-source communities are a natural counterbalance to corporate-owned AI systems. Similarly to SETI@Home, everyone can take some of the unused computing time on their devices, and contribute to a larger system. In this case, it forms a decentralized fabric to replace the storage and computation currently requiring expensive cloud resources from corporate providers.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T16:00:00-08:00",
    "EndTime": "2025-03-06T16:15:00-08:00",
    "Speakers": "Brian Ragazzi",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "SunSecCon Workshop: OSINT for Cybersecurity and Hackers",
    "Description": "Open Source Intelligence (OSINT) is increasing in importance to all areas of Security, particularly Cybersecurity. Organizations use OSINT to hunt for threats and to conduct red team exercises. As the amount of information on the global Internet grows, developing OSINT skills can help attendees to perform better in their jobs and help to secure their organization on multiple levels. This session will present some of the most impactful OSINT techniques and tools, including newer AL and LLM methodologies, in a guided, immersive, hands-on format. The workshop guided and hands-on.",
    "Location": "Room 105",
    "StartTime": "2025-03-06T16:00:00-08:00",
    "EndTime": "2025-03-06T18:00:00-08:00",
    "Speakers": "Sandra Stibbards, Lee McWhorter",
    "Topic": "SunSecCon"
  },
  {
    "Name": "Panel: AI Research Initiatives",
    "Description": "Join our experts for Q&A on AI Research Initiatives",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T16:15:00-08:00",
    "EndTime": "2025-03-06T16:45:00-08:00",
    "Speakers": "",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Openstack edge cloud with SONiC VPP for high-speed and low-latency multi-cloud connectivity",
    "Description": "This demo addresses the challenges of managing latency, data locality, compliance, and availability in distributed environments. By integrating OpenStack edge cloud deployments with SONiC VPP switches over x86 servers across data centers, it enables seamless edge traffic routing through major cloud providers (AWS, Azure, Google) while retaining control at the edge. Optimized for IoT and AI/ML, this solution leverages network slicing to deliver a secure, multi-tenant environment. OpenStack and SONiC together provide high-performance, low-latency connectivity essential for edge computing.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T16:30:00-08:00",
    "EndTime": "2025-03-06T17:00:00-08:00",
    "Speakers": "Tom Yin, Vivekanandan Muthukrishnan, Amby Nagarajan",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Sponsor Talk: The Economics of Migrating from VMware to OpenStack",
    "Description": "A lot has been made about Broadcom's price increases for VMware, and there has also been a lot of attention paid to the technological aspects of migrating to OpenStack. Instead, let's take a look at the economics of the migration and how much it actually ends up costing organizations to migrate both in terms of licensing costs, as well as switching costs. This talk is presented by OpenInfra Days Headline Sponsor - Rackspace Technologies",
    "Location": "Room 107",
    "StartTime": "2025-03-06T16:30:00-08:00",
    "EndTime": "2025-03-06T17:00:00-08:00",
    "Speakers": "Ken Crandall",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Ethical Learnings of Building Distributed and Decentralized AI",
    "Description": "AI systems created and maintained by open-source communities are a natural counterbalance to corporate-owned AI systems. Similarly to SETI@Home, everyone can take some of the unused computing time on their devices, and contribute to a larger system. In this case, it forms a decentralized fabric to replace the storage and computation currently requiring expensive cloud resources from corporate providers.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T16:45:00-08:00",
    "EndTime": "2025-03-06T17:00:00-08:00",
    "Speakers": "",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Cloud Rationalization - Industry Trends to Hybrid Environments",
    "Description": "The last generation of startups were all born and grew up in the Cloud. Now that they've grown and established themselves, they're revisiting their Cloud decisions due to concerns about cost, performance, security, compliance, control, and sizing. However, the expertise to do this has atrophied in Cloud-only shops, and the knowledge needed to do this has been lost. With Infrastructure-as-Code and modern platforms like OpenStack, we can recreate this knowledge and customize hybrid cloud and self-hosted solutions, the future of these Cloud-only companies.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T17:00:00-08:00",
    "EndTime": "2025-03-06T17:30:00-08:00",
    "Speakers": "Nathaniel Moore",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "PostgreSQL Ask Me Anything",
    "Description": "Various PostgreSQL community members attend SCaLE and are willing to meet with attendees and answer any questions. Many aspects of the community are covered: User groups, conference organization, core development, exhibitions, advocates and more! Please come and ask any questions!",
    "Location": "Ballroom G",
    "StartTime": "2025-03-06T17:00:00-08:00",
    "EndTime": "2025-03-06T18:00:00-08:00",
    "Speakers": "Mark Wong, Stacey Haysler, Devrim Gunduz, Jimmy Angelakos, Magnus Hagander, Christophe Pettus",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "Preparing VMware Systems for OpenStack Migration",
    "Description": "Moving from VMware to OpenStack requires careful planning and execution to minimize downtime, ensure compatibility, and maintain operational continuity. In this session, we will explore key steps VMware users can take to prepare their systems, such as assessing resource needs, conducting compatibility checks, and optimizing infrastructure. Attendees will also discover how the FishOS Move It appliance simplifies data migration and reduces the workload typically associated with complex migrations.",
    "Location": "Room 107",
    "StartTime": "2025-03-06T17:00:00-08:00",
    "EndTime": "2025-03-06T17:30:00-08:00",
    "Speakers": "Kenneth Tan",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "PlanetNix Lightning Talks",
    "Description": "Short sessions on all things Nix.",
    "Location": "Room 101",
    "StartTime": "2025-03-06T17:00:00-08:00",
    "EndTime": "2025-03-06T18:00:00-08:00",
    "Speakers": "",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Open Source Personal AI with pAI-OS",
    "Description": "This session will explore why open-source AI is essential for ensuring personal AI remains private, working for you rather than commercial vendors. We’ll discuss the risks of proprietary AI, the growing need for data sovereignty, and how open-source AI offers a secure, customizable alternative. We will also introduce pAI-OS, our own open-source personal AI operating system, designed to empower users with AI they can trust.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T17:00:00-08:00",
    "EndTime": "2025-03-06T17:15:00-08:00",
    "Speakers": "Sam Johnston",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Governing AI for Autonomous Humans",
    "Description": "Data is the backbone of digital interactions and ensuring provenance and ownership is critical for security, privacy, and trust. David Grantham, CEO of Cryptid, will explore the challenges of verifying data authenticity, licensing data access, preventing manipulation, and enabling user control in decentralized systems. Drawing from his work at Cryptid Technologies, Hyperledger, and Polygon, he will discuss cryptographic techniques, zero-trust architectures, and decentralized identity frameworks that empower individuals and organizations to secure, track, and assert ownership over their data.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T17:15:00-08:00",
    "EndTime": "2025-03-06T17:30:00-08:00",
    "Speakers": "",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Moving authentication from a single provider to all the socials!",
    "Description": "OpenStack emerged in 2010 it made sense to use Ubuntu One as their authentication platform. 15 years later OpenStack has become OpenInfra and tools to support one project now need to support several aligned technologies on a single platform, OpenDev. The sysadmins have integrated Keycloak as an Identity broker and authorisation provider but this uncovers several challenges: Keycloak doesn't support OpenID (needed by Ubuntu One); a tool is needed to pre-load keycloak with some user mappings; Keycloak is written in Java. Join the OpenDev Sysadmins as they find the path from problem to solution.",
    "Location": "Room 107",
    "StartTime": "2025-03-06T17:30:00-08:00",
    "EndTime": "2025-03-06T18:00:00-08:00",
    "Speakers": "Tony Breeds",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "O-RAN Lifecycle Management on OpenStack Tacker",
    "Description": "OpenStack resolves many challenges even in container era and RAN. Tacker is contributing telecom usecase to O-RAN SC which is a collaboration between the O-RAN ALLIANCE and Linux Foundation aiming to achieve a solution to unify and accelerate the evolution in the RAN. Tacker is designed for managing lifecycle of RAN components and enables user to deploy network functions on OpenStack or Kubernetes for scalability and availability. In O-RAN SC model, Tacker manages network functions with StarlingX for autonomous deployment.",
    "Location": "Room 106",
    "StartTime": "2025-03-06T17:30:00-08:00",
    "EndTime": "2025-03-06T18:00:00-08:00",
    "Speakers": "Yuya Kuno, Toshiaki Takahashi, Yasufumi Ogawa",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Panel: AI Policy",
    "Description": "Q&A with our AI Policy panel.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T17:30:00-08:00",
    "EndTime": "2025-03-06T17:45:00-08:00",
    "Speakers": "",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Closing Remarks",
    "Description": "Wrap up the day with closing remarks from Reza Razool",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T17:45:00-08:00",
    "EndTime": "2025-03-06T18:00:00-08:00",
    "Speakers": "Reza Rassool",
    "Topic": "Kwaai Summit"
  },
  {
    "Name": "Linux is in the Building",
    "Description": "The challenge of making buildings smarter! Open discussion on how Linux can make a different in making our commercial buildings be safer, more comfortable and more sustainable.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-06T18:00:00-08:00",
    "EndTime": "2025-03-06T19:00:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Research and High Performance Computing Meet and Greet",
    "Description": "Meet and greet for people engaged in research computing or HPC in academia or industry.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-06T18:30:00-08:00",
    "EndTime": "2025-03-06T19:30:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Beyond SAST: Overcoming the Gaps in Static Security Testing",
    "Description": "Static Application Security Testing (SAST) is a cornerstone of vulnerability detection, but its limitations, such as high false positives and lack of runtime context, can leave critical gaps in software security. This discussion will examine where SAST struggles, explore emerging techniques like symbolic execution and hybrid analysis, and debate how modern security tools can enhance accuracy, reduce noise, and provide deeper insights into application risks.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-06T18:30:00-08:00",
    "EndTime": "2025-03-06T19:30:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Managing Test Resources and Images with Zuul",
    "Description": "The Zuul project gating system is used to test changes across multiple git repositories and code review systems before they merge. For the past 12 years, it has relied on an external program called Nodepool to manage test resources and image builds. A brief overview of Zuul for those who are new to the project, and share how to manage test nodes and images with Zuul's newest features.",
    "Location": "Room 106",
    "StartTime": "2025-03-07T09:00:00-08:00",
    "EndTime": "2025-03-07T09:30:00-08:00",
    "Speakers": "James Blair",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Ceph Storage: a Caffeinated Primer",
    "Description": "Ceph is an open source distributed object store, network block device, and file system designed for reliability, performance, and scalability. It runs on commodity hardware, has no single point of failure, and is supported in the Linux kernel.This tutorial will describe the Ceph architecture, share its design principles, and discuss how it can be part of a cost-effective, reliable cloud stack.",
    "Location": "Room 212",
    "StartTime": "2025-03-07T09:00:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "Federico Lucifredi, JC Lopez, Gregory Farnum",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "SunSecCon Keynote: From IC to Manager....and Then Doing It Again",
    "Description": "The path from individual contributor (IC) to leadership in security engineering is often seen as a one-way trajectory—but what happens when the reality of management doesn’t align with your passion for deep technical work? Many security practitioners strive for leadership roles to drive meaningful change, only to find themselves frustrated by the bureaucratic and interpersonal challenges that come with management. Some return to IC roles, seeking hands-on impact, only to realize that true influence often requires a seat at the leadership table.",
    "Location": "Room 105",
    "StartTime": "2025-03-07T09:15:00-08:00",
    "EndTime": "2025-03-07T10:00:00-08:00",
    "Speakers": "Anthony Scheller",
    "Topic": "SunSecCon"
  },
  {
    "Name": "The future of OpenStack operators meetups and community",
    "Description": "In the before times, OpenStack operators met several times a year to network, exchange experience and to bring feedback to the OpenStack development community based on experience of using OpenStack in production at scale. Since the pandemic, and with shrinking travel budgets, in-person meetups have become extremely rare. On the other hand, interest in OpenStack is growing again. We'll take a fresh, no-holds barred look at the status quo and discuss what works for the community in this new reality.",
    "Location": "Room 106",
    "StartTime": "2025-03-07T09:30:00-08:00",
    "EndTime": "2025-03-07T10:00:00-08:00",
    "Speakers": "Chris Morgan",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Flox as a Guided Path for Nix",
    "Description": "Flox aims to simplify software delivery by leveraging Nix. This presentation explores lessons from years of building developer tools and cloud-native systems. Discover how Nix is the key building block, addressing complexities in modern application delivery. The talk emphasizes a guided path for adoption, enabling teams to modernize without needing a Nix expert in every department. Dive into the underlying mindset of Flox's approach to evolving software practices for a simpler experience.",
    "Location": "Room 101",
    "StartTime": "2025-03-07T09:30:00-08:00",
    "EndTime": "2025-03-07T10:00:00-08:00",
    "Speakers": "Michael Stahnke",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Workshop - Intro to Nix",
    "Description": "Get started with Nix",
    "Location": "Room 104",
    "StartTime": "2025-03-07T09:30:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "",
    "Topic": "PlanetNix"
  },
  {
    "Name": "UbuCon Introduction",
    "Description": "Kickoff this year's UbuCon @ SCaLE 22x and layout the events for the day.",
    "Location": "Room 103",
    "StartTime": "2025-03-07T09:30:00-08:00",
    "EndTime": "2025-03-07T10:00:00-08:00",
    "Speakers": "Aaron Prisk, Jason Nucciarone",
    "Topic": "Ubucon"
  },
  {
    "Name": "Boosting MySQL with Vector Search: Introducing the MyVector Plugin",
    "Description": "As vector databases and Generative AI gain momentum, this session introduces the *MyVector Plugin*, which enables vector storage and similarity search in MySQL. Using MySQL’s server component plugin and UDF, the *MyVector Plugin* integrates vector search into MySQL + InnoDB without requiring a separate vector database. The talk covers technical details, challenges, and practical applications, offering valuable insights on adding vector search to MySQL systems and covering how vectors work, practical applications, or both.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "Alkin Tezuysal",
    "Topic": "MySQL"
  },
  {
    "Name": "Take your pgBadger usage to the next level!",
    "Description": "pgBadger is a widely used tool that helps to identify the exact factors slowing down the system, improve SQL for quick wins, and enhance overall system performance. But what if you could do more? Imagine the power of PostgreSQL at your fingertips, which is used for its own log analysis and performance optimization. Explore the latest features in pgBadger and the tools we built on top of it to unlock a world of possibilities!",
    "Location": "Ballroom G",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "Henrietta Dombrovskaya",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "A Hitchhikers Guide to the CNCF Landscape",
    "Description": "In this talk you will learn how to navigate the CNCF Landscape to find information about our projects. You will learn how to search by category & maturity, and understand how organizations use these projects in production. The goal is for you to be confident in your ability to traverse the landscape so the next time you \"go to the website\" you will find what you need.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "Lori Lorusso, Katherine Druckman",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Lessons learnt from Open-Source Implementation in the Mexican Government",
    "Description": "This will be a casual presentation by a former Mexican government official. The talk will touch upon legislation established in federal law in Mexico and government agencies structured to promote the use of open source while driving sovereignty. It will also cover some experiences and lessons learned by the presenter in their experience of driving open-source projects from within the government and some examples that are currently in operation.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "Federico Gonzalez-Waite",
    "Topic": "Open Government"
  },
  {
    "Name": "What's an Anthropologist doing in Meta's Infrastructure?",
    "Description": "As an anthropologist in Meta’s Infrastructure, my job is to integrate culture to applied systems analysis and to design and conduct interventions to effect positive change. This talk explores how we used anthropological research to help Meta shift from “Move Fast and Break Things” to “Move Fast with Stable Infrastructure.” I present 2 interventions where we used culture and behavioral “nudges” to drive change from the bottom up and top down. The aim is to provide actionable guidance on how engineering orgs can adopt social sciences as they scale.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T10:45:00-08:00",
    "Speakers": "Kathryn \"Casey\" Bouskill",
    "Topic": "DevOpsDay LA"
  },
  {
    "Name": "LLMs with Your Data in Your Applications",
    "Description": "You need your own data to be useful with AI and large language models (LLMs). How do you go about that? There has been a lot of focus on making applications intelligent using the power of AI with the help of (LLMs). We will cover how to add intelligence to existing applications with an overview of different techniques starting from prompt engineering, using vector stores to improve the results, and building intelligent agents to solve a problem. You will learn about the techniques using open-source frameworks to build LLM-powered applications like LangChain & LlamaIndex.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "Matt Ingenthron",
    "Topic": "Open Source AI"
  },
  {
    "Name": "Seamless migration from VMware to OpenStack using vJailbreak tool",
    "Description": "Are you a VMware customer looking at Openstack as an alternative? Are you worried about the labor cost, complexity and reliability of migration? Are you worried about the downtime of the migration and its reliability? Are you worried about your Windows workloads not being operational in the new environment? We will discuss how the vJailbreak toolkit can answer all of these questions and more with a live demonstration.",
    "Location": "Room 106",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T10:30:00-08:00",
    "Speakers": "Pooja Ghumre, Chris Jones",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Standing on Code: Advancing Scientific Discovery Through Sustainable Software Practices",
    "Description": "Scientific progress relies on incremental improvements, famously described by Newton’s \"on the shoulders of giants.\" While this is true for scientific literature, code-driven analysis has not kept pace. As a scientist who transitioned from fieldwork to modeling land-atmosphere exchange, I've seen how research code often lacks long-term maintenance, limiting reuse. Research teams develop code over short timescales, publish, and move on. This talk proposes a paradigm shift in scientific coding practices, incorporating software engineering for sustainable, collaborative open-source code.",
    "Location": "Room 211",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "Alexandre Renchon",
    "Topic": "Applied Science"
  },
  {
    "Name": "Embedded Programming Workshop Day 2",
    "Description": "Day 2 of a a two day class on embedded programming. We will be programming a STM Arm chip with no operating system. This will be bare metal programming. Topics include what the compiler does behind the scenes, I/O direct to the hardware, memory layout, reading assembly, and interrupt programming. Pre-registration (in addition to your your conference registration) is required.",
    "Location": "Room 209",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T17:00:00-08:00",
    "Speakers": "Steve Oualline",
    "Topic": "Workshops"
  },
  {
    "Name": "Adventures in Mesh Networking at DEF CON with NixOS",
    "Description": "At DEF CON 32, a few friends pushed binary caching on NixOS to its limits. Thanks to a generous hardware donation by Protectli, we managed to get a mesh network of binary cache servers running in our backpacks, with Nebula mesh VPN and 802.11s mesh WiFi running between them using TPMs for key exchange. We see a future where trustworthy software can be built and fetched from nearly anywhere, and every device can be a node in a swarm of Nix binary caches. Follow along as we build a true edge CDN!",
    "Location": "Room 101",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T10:30:00-08:00",
    "Speakers": "Morgan Jones",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Simplify Your Data Science Workflow on Ubuntu with Canonical’s Data Science Stack",
    "Description": "Data scientists often face complex challenges when setting up their development environments, from managing dependencies to ensuring GPU compatibility for high-performance workloads. Canonical’s Data Science Stack (DSS) removes these hurdles, providing a seamless, ready-to-use environment tailored for Ubuntu.",
    "Location": "Room 103",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "Ken VanDine",
    "Topic": "Ubucon"
  },
  {
    "Name": "Adversarial Intelligence: Redefining Application Security through the eyes of an attacker",
    "Description": "This presentation explores Adversarial Intelligence - an approach that views application security from an attacker’s perspective. Drawing from vulnerability research experience at the NSO Group and building Pegasus, the speaker will highlight how overlooked low and medium vulnerabilities can be combined to execute successful attacks. By examining attack chains and application runtime behavior, attendees will see how gaps often missed by traditional methods are exposed. Attendees will learn about effective tools and techniques for detecting and mitigating these threats.",
    "Location": "Room 105",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T10:45:00-08:00",
    "Speakers": "Roy Talyosef",
    "Topic": "SunSecCon"
  },
  {
    "Name": "Fireside Chat with Kelsey Hightower",
    "Description": "We will discuss Kelsey's thoughts on what is happening with Cloud Native and the Cloud. Find out what has been interesting in public and private clouds and ask your questions.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-07T10:00:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "Justin Garrison, Kelsey Hightower",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Building a Chromebook replacement with NixOS",
    "Description": "As Linux users, we often install Linux for friends and family, but many struggle with updates, packaging quirks, and system maintenance—leaving you to fix issues and them frustrated. Instead of simply suggesting they get a Chromebook, what if we could create a similar experience with NixOS? My Nixbook project delivers automatic updates, easy Flatpak app installs, and sane defaults for everyday users. In this talk, I’ll share how I built it and made it work flawlessly.",
    "Location": "Room 101",
    "StartTime": "2025-03-07T10:30:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "Mike Kelly",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Sponsor Talk: How to Simplify and Accelerate VMware Migration to OpenStack using Universal Backup, Recovery and Migration Solution",
    "Description": "This topic introduces ZIA technology—a revolutionary, cloud-agnostic migration solution that tackles the complexities of heterogeneous migration issues. By harnessing the power of ZIA, organizations can not only simplify but also accelerate their VMware migration to OpenStack, ensuring a seamless move and uninterrupted business operations.",
    "Location": "Room 106",
    "StartTime": "2025-03-07T10:30:00-08:00",
    "EndTime": "2025-03-07T11:00:00-08:00",
    "Speakers": "DJ MIN",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Kolla User Forum",
    "Description": "This session is for developers, operators and people interested OpenStack Kolla/Kolla-Ansible/Kayobe deployment projects.It serves as an information gathering session for OpenStack Kolla developers to find out current/future users problems, requests for enhancements and discussion about project future plans.It also serves as a venue for Kolla community to get together and grow the community in numbers, because that is what makes the open source projects stronger.",
    "Location": "Room 212",
    "StartTime": "2025-03-07T11:00:00-08:00",
    "EndTime": "2025-03-07T11:30:00-08:00",
    "Speakers": "Michal Nasiadka",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Turning Incidents into Insights, Not Insults",
    "Description": "Let’s face it—most incident retrospectives are about as useful as a code comment that says 'fix this later'. They’re packed with finger-pointing, hindsight bias, and imaginary scenarios where everyone did everything perfectly. In this talk, we’ll explore a blame-aware, human-centered approach to incident management that turns problems into learning opportunities. With a focus on quality observability, practical service catalogs, and the essential role of customer support, this session offers actionable strategies for building resilience and fostering real, lasting improvements.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-07T11:00:00-08:00",
    "EndTime": "2025-03-07T11:45:00-08:00",
    "Speakers": "Heather Osborn",
    "Topic": "DevOpsDay LA"
  },
  {
    "Name": "A Sustainable Nix, State of the Union",
    "Description": "Lets explore how to ensure the sustainability of the Nix ecosystem with community leads including the SC and Foundation. We will dive into what it takes to create and maintain a robust, reliable environment for years to come. Covering the community’s milestones in 2024, from infra to governance, and about both the hard-won lessons and the innovations shaping Nix’s future.",
    "Location": "Room 101",
    "StartTime": "2025-03-07T11:00:00-08:00",
    "EndTime": "2025-03-07T11:30:00-08:00",
    "Speakers": "Ron Efroni",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Build your own microcloud",
    "Description": "Do you want to build your own cloud in your homelab? Or just have a way to simulate a cloud environment on your laptop for development and testing? MicroCloud is the right choice for that. A MicroCloud is a lightweight, open source cloud built with security and automation in mind. They are deployed with only one command, without the need for specialist knowledge.",
    "Location": "Room 103",
    "StartTime": "2025-03-07T11:00:00-08:00",
    "EndTime": "2025-03-07T12:00:00-08:00",
    "Speakers": "Miona Aleksic",
    "Topic": "Ubucon"
  },
  {
    "Name": "AI Agents in a Semi-Autonomous Security Operations Center (SOC)",
    "Description": "Cybersecurity Analyst burnout is real and stakes are higher than ever as all the data is stored completely digitally and threat actors are always after it. In detection and response, detection is not easily achieved and response is not fast. Chances are high that before an alert hits the SIEM/SOAR, some form of Machine Learning and Artificial Intelligence is already been used by the suite of cyber defense products in the SOC.",
    "Location": "Room 105",
    "StartTime": "2025-03-07T11:00:00-08:00",
    "EndTime": "2025-03-07T11:45:00-08:00",
    "Speakers": "Keyur Rajyaguru",
    "Topic": "SunSecCon"
  },
  {
    "Name": "Next-Generation Prompt Engineering: The Verification Revolution in AI Engineering",
    "Description": "As AI applications grow in complexity, traditional prompt engineering methods fall short, creating fragile and costly systems. This talk introduces next-generation prompt engineering, offering adaptable, cost-optimized techniques for stable performance across diverse, including open-source, environments. Topics include multi-model consistency, model adaptability, synthetic data for robust testing, and cost optimization through structured prompting. Attendees will gain actionable insights to build scalable, reliable AI applications that thrive in a multi-model, open-source landscape.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-07T11:15:00-08:00",
    "EndTime": "2025-03-07T12:15:00-08:00",
    "Speakers": "Masahji Stewart",
    "Topic": "Open Source AI"
  },
  {
    "Name": "CattleSpa: automated healing of your cloud infrastructure",
    "Description": "A behind-the-scenes look at how our small systems engineering team manages our infrastructure. This is centered around MySQL and MongoDB. We'll go through real-world implementation with code examples, showing how we: Built a flexible automation framework that adapts to new technologies Created a sustainable way for a small team to manage enterprise-scale infrastructure Turned \"those #@$% servers\" into well-behaved, predictable systems",
    "Location": "Ballroom H",
    "StartTime": "2025-03-07T11:15:00-08:00",
    "EndTime": "2025-03-07T12:15:00-08:00",
    "Speakers": "Carmen Mason, Allan Mason",
    "Topic": "MySQL"
  },
  {
    "Name": "Going All-in on Gateway API - Replacing Ingresses and Enhancing a Service Mesh",
    "Description": "Anyone who has used the Ingress resource in Kubernetes for any length of time knows that it is lacking in flexibility and, as a result, has resulted in just about every ingress-related project creating their own bespoke resource types or complex set of needed annotations. Gateway API is the community’s answer to alleviating this pain. This talk will dive into my experiences utilizing it with Traefik for north-south traffic instead of Ingress and IngressRoute resources and with Linkerd to enhance visibility and flexibility of the east-west traffic traversing the service mesh.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-07T11:15:00-08:00",
    "EndTime": "2025-03-07T12:15:00-08:00",
    "Speakers": "Gene Liverman",
    "Topic": "Cloud Native"
  },
  {
    "Name": "The Open Source Universe of Numerical Relativity",
    "Description": "Numerical relativity researchers employ advanced numerical algorithms to solve equations from Einstein's theory of general relativity. These calculations are crucial to modeling the bending of light around black holes, the gravitational waves stirred up by merging black holes, and more. This is done almost entirely with open-source software developed by the research community, making it a wonderful open source software success story. As a researcher in the field, I will provide a tour of the thriving open-source ecosystem that makes my work possible, and of promising near-future developments.",
    "Location": "Room 211",
    "StartTime": "2025-03-07T11:15:00-08:00",
    "EndTime": "2025-03-07T12:15:00-08:00",
    "Speakers": "Erik Wessel",
    "Topic": "Applied Science"
  },
  {
    "Name": "Develop, Test, and Deploy with Podman Desktop",
    "Description": "These days we all spend a lot of time developing for Kubernetes. Wouldn't it be great if you could develop and test your containerized application from an easy-to-use desktop application, and not need to touch Kubernetes clusters until you're ready for staging? With Podman Desktop, you can!",
    "Location": "Ballroom B",
    "StartTime": "2025-03-07T11:15:00-08:00",
    "EndTime": "2025-03-07T12:15:00-08:00",
    "Speakers": "Josh Berkus",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Digital Citizen Participation - Success Factors and Challenges",
    "Description": "Digital citizen participation is widely regarded as a significant promise for democracy, yet its success is far from guaranteed. In this presentation, we will explore the key factors that contribute to successful and impactful participation. Drawing on examples and lessons learned from our extensive Consul community, which includes over 250 municipalities and governments, we aim to highlight practical insights and success strategies that not only build long-term trust in democracy but also yield innovative results.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-07T11:15:00-08:00",
    "EndTime": "2025-03-07T12:15:00-08:00",
    "Speakers": "Simon Strohmenger",
    "Topic": "Open Government"
  },
  {
    "Name": "What's our Vector, Victor?",
    "Description": "AI and LLMs are all the rage these days, but the real fun stuff doesn't happen until some kind of database is involved. This talk will explain how Postgres, pgvector, and the pg_vectorize extension can transform a generic hallucinating chatbot into a trained expert savant.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-07T11:15:00-08:00",
    "EndTime": "2025-03-07T12:15:00-08:00",
    "Speakers": "Shaun Thomas",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "How to make Nix five times faster",
    "Description": "I have a confession: I love Nix. So much so, that I want to use it to build all my software. But there's a catch - why is Nix so slow? My search for answers began with a bash loop run amok, and ends with Fantail - a new frontend development server powered by Nix and Haskell, with builds 5x faster than the Nix CLI. If you've ever looked up at the sky and wondered if it's possible to use the Nix C++ interface to cache Flake inputs in-memory, this is the talk for you. If not, come along anyway!",
    "Location": "Room 101",
    "StartTime": "2025-03-07T11:30:00-08:00",
    "EndTime": "2025-03-07T12:00:00-08:00",
    "Speakers": "Nick Johnstone",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Python on Nix? Yes, it is possible!",
    "Description": "Want to leverage the powerful features of the Nix ecosystem, but you don't want to learn the Nix programming language? This talk will show you how you can use Python and the python-nix library to easily create Nix packages in a way that it is appealing for both Nix and Python programmers.",
    "Location": "Room 104",
    "StartTime": "2025-03-07T11:30:00-08:00",
    "EndTime": "2025-03-07T12:00:00-08:00",
    "Speakers": "Matteo Fusi",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Getting started with OpenTelemetry",
    "Description": "Navigating application instrumentation and monitoring can be challenging. In this presentation, I will share my journey as a Go developer using OpenTelemetry to collect and visualize telemetry data, while also explaining some of the underlying mechanisms. Although OpenTelemetry is a widely adopted open-source solution, its implementation requires several key steps: instrumentation, data extraction, storage selection, and visualization. I will break down these steps and demonstrate how using the Grafana ecosystem makes it easier to get started with OpenTelemetry.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-07T12:30:00-08:00",
    "EndTime": "2025-03-07T13:30:00-08:00",
    "Speakers": "Shirley Wang",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Hidden Gems in MySQL Shell",
    "Description": "MySQL Shell is a modern CLI for connecting to, and interacting with, MySQL Instances. But there is so much more!! In this session we will demonstrate some of the cooler, but lesser-known, features of MySQL Shell. These features include, but are not limited to: creating sandbox instances for testing, managing MySQL replication, and dumping data to (and loading data from) a cloud storage bucket.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-07T12:30:00-08:00",
    "EndTime": "2025-03-07T13:30:00-08:00",
    "Speakers": "Scott Stroz",
    "Topic": "MySQL"
  },
  {
    "Name": "How DIY Robotics Can Help With Environmental Science",
    "Description": "Scarab is an open-source environmental monitoring robot designed to collect real-time data on air and water quality. Built from repurposed parts, Scarab was inspired by insect movement, WWII aircraft designs and the need for air quality monitoring after the 2023 wildfires. Its sensors detect various gases in the environment, making it a tool for climate research. This presentation will explore Scarab’s build process, the importance of open-source technology in environmental science, and how anyone can contribute to global sustainability through DIY robotics.",
    "Location": "Room 211",
    "StartTime": "2025-03-07T12:30:00-08:00",
    "EndTime": "2025-03-07T13:30:00-08:00",
    "Speakers": "Travis Hughes",
    "Topic": "Applied Science"
  },
  {
    "Name": "Kubernetes and the Dragons in Linux Kernel vs. Userspace Tools",
    "Description": "Journey into the realm of Kubernetes, where the Linux kernel and userspace tools sometimes clash, threatening your cluster's harmony. In this talk, we will dive into real-world stories of overcoming incompatibilities that can disrupt your clusters, from iptables quirks to modprobe mysteries. These challenges are not unique but are shared by the entire Kubernetes community. Together, we will explore strategies to tame these dragons and ensure that clusters thrive, with guidelines for harmonizing the Linux kernel and userspace tools.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-07T12:30:00-08:00",
    "EndTime": "2025-03-07T13:30:00-08:00",
    "Speakers": "Jussi Nummelin",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Building a Network of Open Source Program Offices at the University of California",
    "Description": "Members of the newly formed University of California network of OSPOs will discuss how partner campuses are aiming to expand the reach of research and education efforts within the UC system by leveraging open source and the expertise of all our campuses. In particular, this session will focus on how campus OSPOs can help spread innovation and knowledge to their surrounding communities. They will also address how universities can work with open source communities to expand their communities and improve project sustainability.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-07T12:30:00-08:00",
    "EndTime": "2025-03-07T13:30:00-08:00",
    "Speakers": "Stephanie Lieggi, Tim Dennis",
    "Topic": "Open Government"
  },
  {
    "Name": "Anatomy of Table-Level Locks in PostgreSQL",
    "Description": "Understanding table-level locks in Postgres is a quite useful skill as almost all DDL operations require acquiring one of the different types of table-level locks on the object being manipulated. If not managed well, schema changes can result in downtime. In this talk we will explain fundamentals of table-level locking, covering how different types of locks are applied and queued during schema changes. Attendees will learn how to identify and manage lock conflicts to minimize downtime, avoid deadlocks, and maintain smooth database operations, even during high-concurrency schema changes.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-07T12:30:00-08:00",
    "EndTime": "2025-03-07T13:30:00-08:00",
    "Speakers": "Gulcin YildirimJelinek, Andrew Farries",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "Harnessing Open Source Solutions in the Generative AI Landscape",
    "Description": "Attendees will explore the potential of open-source AI solutions in this presentation and/or demo. We'll dive into practical demonstrations using the LLaMA-Factory library to finetune open-sourced models (e.g. qwen, llama). We will also showcase how to efficiently host and serve these models on vLLM. This session aims to empower practitioners to move past proprietary AI providers by leveraging several open-source frameworks. Key benefits include full control over model behavior, cost efficiency through self-hosting, and the ability to tailor models using advanced fine-tuning techniques.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-07T12:30:00-08:00",
    "EndTime": "2025-03-07T13:30:00-08:00",
    "Speakers": "james healy",
    "Topic": "Open Source AI"
  },
  {
    "Name": "OpenInfra Leadership Meet and Greet",
    "Description": "Meet leaders from the OpenInfra Foundation, board and projects.",
    "Location": "Room 212",
    "StartTime": "2025-03-07T13:00:00-08:00",
    "EndTime": "2025-03-07T14:00:00-08:00",
    "Speakers": "Amy Marrich, Julia Kreger, Jonathan Bryce, Mark Collier",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Live Ask Noah Show",
    "Description": "Join us for a live recording of the AskNoah show where we'll be discussing all the things happening around the Ubuntu world!",
    "Location": "Room 103",
    "StartTime": "2025-03-07T13:00:00-08:00",
    "EndTime": "2025-03-07T14:00:00-08:00",
    "Speakers": "Noah Chelliah",
    "Topic": "Ubucon"
  },
  {
    "Name": "Automated secure mobile code reviews using Danger",
    "Description": "Due to their widespread use and the sensitive data they handle, mobile applications are prime targets for attackers. Ensuring secure coding practices protects user information and maintains application integrity. However, consistently enforcing these practices across development teams is a complex challenge, especially in fast-paced environments where speed often competes with security priorities.",
    "Location": "Room 105",
    "StartTime": "2025-03-07T13:00:00-08:00",
    "EndTime": "2025-03-07T13:45:00-08:00",
    "Speakers": "Saurabh Sharma",
    "Topic": "SunSecCon"
  },
  {
    "Name": "VALKEY 101 - A Superfast in-memory database",
    "Description": "VALKEY is a superfast in-memory distributed database with clustering, redundancy, and low latency. If you need a cache, then you need to look at VALKEY. The VALKEY project started when REDIS changed from an open-source license to extort money from its community. VALKEY is a much-improved fork of REDIS, and the Linux Foundation supports the project. This session briefly covers the fork's 'why,' explores some exciting new features, and shows you how to start with VALKEY.",
    "Location": "Room 106",
    "StartTime": "2025-03-07T13:30:00-08:00",
    "EndTime": "2025-03-07T14:00:00-08:00",
    "Speakers": "Dave Stokes",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "DevEx as a Strategic Asset: Linking Developer Success into Business Outcomes",
    "Description": "Platform Engineering and DevOps leaders must move beyond traditional technical and productivity metrics to ensure lasting success. Developer Experience (DevEx) is no longer a luxury—it's a critical business factor that directly influences developer retention, minimizes bottlenecks, speeds up time to market, and leads to superior business outcomes, including higher revenue. Attendees will learn how to effectively communicate the value of DevEx in business value to gain internal buy-in from leadership and stakeholders, even those without a technical background.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-07T13:30:00-08:00",
    "EndTime": "2025-03-07T13:45:00-08:00",
    "Speakers": "Sara Huddleston",
    "Topic": "DevOpsDay LA"
  },
  {
    "Name": "Tvix store in production",
    "Description": "Replit.com is website used by millions of users to collaboratively create software with their teammates and now with Replit’s AI Agent. Replit uses Nix to manage the underlying development environments. When building a Nix environment, downloading files from cache.nixos.org can take a long time, and many files would be duplicated across Repls. In this talk, I will show how Replit uses Nix local-overlay-stores to manage Nix caching, as well as our new cache disk architecture using tvix-store.",
    "Location": "Room 101",
    "StartTime": "2025-03-07T13:30:00-08:00",
    "EndTime": "2025-03-07T14:00:00-08:00",
    "Speakers": "Victor Fuentes",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Evaluating the Nix Evaluator: Why Nix Performance Sometimes... Doesn't",
    "Description": "Nix evaluation performance is a known, long-standing issue to the community. This talk will cover a benchmarking setup, concessions to that setup made to retain the author's sanity, and ways to improve evaluation performance and their trade-offs.",
    "Location": "Room 104",
    "StartTime": "2025-03-07T13:30:00-08:00",
    "EndTime": "2025-03-07T14:00:00-08:00",
    "Speakers": "Connor Baker",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Platform Engineers as Product Managers: 10x Your Developer Experience",
    "Description": "Discover how adopting this mindset can transform your platform engineering efforts into a high-impact, developer-centric initiative that empowers your teams and drives organizational success.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-07T13:45:00-08:00",
    "EndTime": "2025-03-07T14:00:00-08:00",
    "Speakers": "Justin Reock",
    "Topic": "DevOpsDay LA"
  },
  {
    "Name": "From Zero to Code: A Hands-On Guide to Making Your First OpenStack Code Contribution",
    "Description": "Attendees will understand how developers identify bugs/features to work on, create contributor accounts, develop the code change, test it against an OpenStack deployment and submit it for community code review. As seasoned core maintainers of OpenStack, we can share strategies we have learned to engage with the community and get these code changes merged. We hope this session will serve as a quickstart to in-person audiences who get to follow along hands-on.",
    "Location": "Room 212",
    "StartTime": "2025-03-07T14:00:00-08:00",
    "EndTime": "2025-03-07T15:30:00-08:00",
    "Speakers": "Carlos Eduardo da Silva, Goutham Pacha Ravi, Ashley Rodriguez",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "How did it come to this? Untangling SA, Dev(*)Ops, SRE, and PE",
    "Description": "Remember how hard we all faught to keep DevOps from becoming a title? Not only did we fail we saw a host of new titles like DevSecOps, SRE and PE burst onto the scene. Are these all synonymous? Are they distinct roles? Have seen the end of this cambrian explosion? Come join me as we untangle the mess and consider how we get things back on track.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-07T14:00:00-08:00",
    "EndTime": "2025-03-07T14:45:00-08:00",
    "Speakers": "Ben Rockwood",
    "Topic": "DevOpsDay LA"
  },
  {
    "Name": "Cloud Rebalance",
    "Description": "At Walmart, Openstack clouds host large-scale applications with varying characteristics. We developed an algorithm to efficiently distribute and place workloads, preventing hotspots and performance degradation caused by noisy neighbors. The Cloud Rebalance strategy is designed to complement Openstack’s Live Migration feature, enhancing workload placement.",
    "Location": "Room 106",
    "StartTime": "2025-03-07T14:00:00-08:00",
    "EndTime": "2025-03-07T14:30:00-08:00",
    "Speakers": "Sukesh Behera, Jimmy McCrory",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Configurable Flakes",
    "Description": "Flakes are a way to share Nix artifacts in a reproducible, composable and discoverable way. A major limitation of flakes right now is that they are not *configurable*: there is no easy way to pass arguments to a flake from the command line. In this talk, I describe an extension of flake schemas that make flakes configurable in a way that preserves discoverability, hermetic evaluation and evaluation caching. This addresses a major blocker in the adoption of flakes.",
    "Location": "Room 101",
    "StartTime": "2025-03-07T14:00:00-08:00",
    "EndTime": "2025-03-07T14:30:00-08:00",
    "Speakers": "Eelco Dolstra",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Sandstone: Fast incremental Haskell builds using dynamic derivations",
    "Description": "So far, efforts to use Nix as a build system have suffered from either insufficient incrementality or excessive evaluation time. Sandstone is a new tool to plan Haskell builds using Nix that achieves full incrementality without affecting eval times at all. It does this by using the new experimental \"dynamic derivations\" to create fine-grained build steps without involving the Nix language *at all*. We hope that Sandstone will kick of a new era of language-specific tooling using Nix!",
    "Location": "Room 104",
    "StartTime": "2025-03-07T14:00:00-08:00",
    "EndTime": "2025-03-07T14:30:00-08:00",
    "Speakers": "John Ericson",
    "Topic": "PlanetNix"
  },
  {
    "Name": "Unlocking the Full Potential of Open-Source",
    "Description": "There are some parts of running applications in the cloud that can be very difficult to automate: integrating dependencies, scaling, upgrades, setting up observability. But what if... it could be easy? In this talk I will show you how you can use the fully free and open source Juju from Canonical to unlock this power for your applications. I will demonstrate how Go, Django, Flask and FastAPI apps can be \"charmed\" with incredible ease to unlock these benefits.",
    "Location": "Room 103",
    "StartTime": "2025-03-07T14:00:00-08:00",
    "EndTime": "2025-03-07T15:00:00-08:00",
    "Speakers": "Alastair Flynn",
    "Topic": "Ubucon"
  },
  {
    "Name": "Data Breaches and Dark Secrets: The Corporate Side",
    "Description": "Are you looking to break into the thrilling world of cyber and physical security? Curious about how data breaches impact everyday folks and interested in helping organizations recover and minimize the impact of attacks? Join us for an eye-opening discussion that pulls back the curtain on data breaches, corporate cover-ups, and the harsh realities that aspiring security professionals face in today’s digital landscape.",
    "Location": "Room 105",
    "StartTime": "2025-03-07T14:00:00-08:00",
    "EndTime": "2025-03-07T14:45:00-08:00",
    "Speakers": "Andrew Amaro",
    "Topic": "SunSecCon"
  },
  {
    "Name": "When Things Go Sideways: Troubleshooting the OTel Operator",
    "Description": "Many organizations use Kubernetes (k8s) to run their software. The OpenTelemetry (OTel) Operator can enhance observability by simplifying OTel management within k8s clusters. In their talk, Adriana and Reese will provide an overview of the Operator, addressing common issues that new users may face, including installation, auto-instrumentation, and deployment challenges. They will offer practical solutions to these problems, aiming to empower attendees with the knowledge and confidence to effectively leverage the Operator in their k8s environments.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-07T14:30:00-08:00",
    "EndTime": "2025-03-07T15:30:00-08:00",
    "Speakers": "Adriana Villela, Reese Lee",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Leveling up your MySQL Skills",
    "Description": "This talk is about users who uses MySQL either as a normal user or as a Database Administrator (DBA) or someone who just want to view the query result for analytics and need to visualize the result so that be able to monitor and observe it and even send out alerts if detect a change in patterns or KPIs using Grafana OSS and Alerting module.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-07T14:30:00-08:00",
    "EndTime": "2025-03-07T15:30:00-08:00",
    "Speakers": "Syed Usman Ahmad",
    "Topic": "MySQL"
  },
  {
    "Name": "How LA Metro is using Open Data to prepare for the 2028 Olympics and Paralympics",
    "Description": "What do we need to do to achieve the goal of making 2028 a no-car Olympics & Paralympics? While GTFS-static and GTFS-realtime have been widely adopted as transit data standards for several years now, they are from complete. Gaps exist in the spec and barriers to adoption exist for data propducers and consumers alike. However, with the Olympic & Paralympic Games coming up, we have an incredible chance to level up LA's transit data!",
    "Location": "Ballroom C",
    "StartTime": "2025-03-07T14:30:00-08:00",
    "EndTime": "2025-03-07T15:30:00-08:00",
    "Speakers": "Monica Waggoner",
    "Topic": "Open Government"
  },
  {
    "Name": "Evaluating the Effectiveness of Retrieval Augmented Generation (RAG) in Real-World Applications",
    "Description": "With the rise of large language models (LLMs) enhanced by retrieval augmented generation (RAG), it has become essential to develop rigorous evaluation methodologies to assess their effectiveness across diverse use cases. RAG combines a model's generative capabilities with information retrieval, allowing for contextually relevant responses grounded in up-to-date, factual knowledge. This talk will focus on the unique challenges and best practices for evaluating RAG applications covering quantitative metrics (e.g., accuracy, relevance, etc).",
    "Location": "Ballroom F",
    "StartTime": "2025-03-07T14:30:00-08:00",
    "EndTime": "2025-03-07T15:30:00-08:00",
    "Speakers": "Nithish Raghunandanan",
    "Topic": "Open Source AI"
  },
  {
    "Name": "9.2 to 15 and beyond",
    "Description": "Some signs that you may want to think about upgrading postgres: You have to click on the “Unsupported versions” row to double check everything you read in the docs You hear about a feature that has been around since postgres 11 (or 9.3) and wish that you were able to use it Whenever you mention the version you are running, people mention how out of date it is It can be hard to find answers when things get tricky. I may not have all of those answers, but I want you at least to know that you are not alone.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-07T14:30:00-08:00",
    "EndTime": "2025-03-07T15:30:00-08:00",
    "Speakers": "Nick Meyer",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "Bringing Joy to Kubernetes Deployments",
    "Description": "In this talk, Murriel and Elizabeth will be your guides on a brief tour of several open source tools for deploying a workload into Kubernetes. Our journey will begin with manual hello world deployments and from there we will explore some of the most common modern tools for CI/CD, including a demo speedrun!",
    "Location": "Ballroom B",
    "StartTime": "2025-03-07T14:30:00-08:00",
    "EndTime": "2025-03-07T15:30:00-08:00",
    "Speakers": "Murriel Perez McCabe, Elizabeth Ponce",
    "Topic": "Cloud Native"
  },
  {
    "Name": "AI, Cloud Computing, and Software Engineering Concepts in Seismology",
    "Description": "The current state of earthquake monitoring systems utilize standard algorithms that process seismic data and run software on local servers. While this system has proven effective for twenty-plus years, it is a dated system in need of modernization. The Southern California Seismic Network is exploring ways to generate earthquake products with modern software technologies such as cloud-native services, AI-powered models, serverless computing, containers, and infrastructure as code. The SCSN aims to develop a system that other networks might be motivated to adopt.",
    "Location": "Room 211",
    "StartTime": "2025-03-07T14:30:00-08:00",
    "EndTime": "2025-03-07T15:30:00-08:00",
    "Speakers": "Ryan Tam",
    "Topic": "Applied Science"
  },
  {
    "Name": "From VMware to OpenStack: Redefining the Virtualization Landscape with Open Source Software",
    "Description": "Join us as we zero in on the virtualization market in North America and hear how OpenStack providers are building cloud-native migration strategies for their customers. Our panel of experts will be moderated by Jimmy McArthur, Director, Business Development at OpenInfra Foundation.",
    "Location": "Room 106",
    "StartTime": "2025-03-07T14:30:00-08:00",
    "EndTime": "2025-03-07T15:15:00-08:00",
    "Speakers": "Jimmy McArthur, Ken Crandall, DJ MIN",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Firewalls and Friendships: Building a Balanced Professional Network",
    "Description": "In DevOps, we often interact with networks via ingress/egress, routers, subnets/IP addresses, and firewalls, but can we learn anything from our experience with these while improving our professional network? In this age of layoffs and AI, ensuring we are authentically connected to our communities is more important than ever. Let’s take what we’ve learned from systems networks and apply it to our professional network.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-07T15:00:00-08:00",
    "EndTime": "2025-03-07T15:30:00-08:00",
    "Speakers": "Annie Hedgpeth",
    "Topic": "DevOpsDay LA"
  },
  {
    "Name": "Charmed HPC on OpenStack Sunbeam",
    "Description": "In this talk, you will learn how to use Sunbeam – a cloud-native OpenStack powered by Kubernetes – and Charmed HPC to streamline the deployment and management of modern HPC clusters. You will learn how to use Sunbeam to set up OpenStack, and how to dpeloy Charmed HPC on top of OpenStack. Lastly, you will learn how to set up Kubernetes next to your HPC system to provide services such as identity management and observability metrics. Setting up a modern HPC system does not need to be a dark and stormy process - it can be as clear as day with Sunbeam!",
    "Location": "Room 103",
    "StartTime": "2025-03-07T15:00:00-08:00",
    "EndTime": "2025-03-07T16:00:00-08:00",
    "Speakers": "Jason Nucciarone",
    "Topic": "Ubucon"
  },
  {
    "Name": "Exposed Detection Rules: What’s Next for Defenders?",
    "Description": "Open source security tools make security accessible. While their benefits are well known, they present a unique challenge: attackers have the same access to detection rules as defenders and contributors. This transparency can provide attackers with a roadmap to bypass defenses. How can open source contributors continue to maintain and evolve these tools while effectively countering attackers?",
    "Location": "Room 105",
    "StartTime": "2025-03-07T15:00:00-08:00",
    "EndTime": "2025-03-07T15:45:00-08:00",
    "Speakers": "Kennedy Toomey",
    "Topic": "SunSecCon"
  },
  {
    "Name": "Sponsor Talk: Jetstream2: Democratizing Cloud Computing for U.S. Research",
    "Description": "Jetstream2 is a distributed OpenStack-based research cloud spanning five U.S. institutions, offering researchers GPU-accelerated and large-memory virtual machines, as well as containerized workflows through Kubernetes clusters. Users can deploy and manage resources via web interfaces, CLI, or APIs. From interactive development environments (Linux desktops, JupyterHub, RStudio) to web-hosted applications, we make advanced computing accessible to researchers regardless of their cloud or HPC experience. NSF-funded through ACCESS and NAIRR Pilot. Learn more at: https://jetstream-cloud.org/",
    "Location": "Room 106",
    "StartTime": "2025-03-07T15:15:00-08:00",
    "EndTime": "2025-03-07T15:30:00-08:00",
    "Speakers": "Julian Pistorius",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "OpenStack Scientific SIG Meeting",
    "Description": "OpenStack is a platform powering a vast array of scientific endeavors. The Scientific SIG is dedicated to representing and advancing the use cases and needs of research and high-performance computing atop OpenStack. If you work or play in scientific computing, come to this gathering of the SIG to connect with colleagues, discuss common interests, and help make OpenStack better for doing science!",
    "Location": "Room 212",
    "StartTime": "2025-03-07T15:30:00-08:00",
    "EndTime": "2025-03-07T16:00:00-08:00",
    "Speakers": "Martial Michel",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "OpenStack as a Catalyst for Innovation, Resilience, and Cost Efficiency",
    "Description": "In this presentation we'll review the different aspects to address when trying to ramp up OpenStack implementation projects as a cloud infrastructure that allows us to control costs, drive flexibility, innovation and speed to market. We will learn how to pitch mentioning key aspects that can be attractive to decision makers.",
    "Location": "Room 106",
    "StartTime": "2025-03-07T15:30:00-08:00",
    "EndTime": "2025-03-07T16:00:00-08:00",
    "Speakers": "Francisco Araya",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Lessons learned when managing MySQL in the cloud",
    "Description": "Managing MySQL in the cloud presents unique challenges and opportunities for optimization. This article highlights key lessons learned, including best practices for performance tuning, scalability, and disaster recovery in cloud-based environments.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-07T15:45:00-08:00",
    "EndTime": "2025-03-07T16:45:00-08:00",
    "Speakers": "Igor Donchovski",
    "Topic": "MySQL"
  },
  {
    "Name": "Technopolitics: Public Digital Infrastructure for Democracy with Decidim",
    "Description": "This session will explore the history of digital resistance through open-source tools, examine different open government approaches with Decidim. We will delve into real-world use cases from Spain, the USA, and Brazil. We will look how local governments have accelerated democratic engagement through open public digital infrastructure. Finally, we will reflect on how we can contribute to building this infrastructure and shaping the future of digital democracy at our level.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-07T15:45:00-08:00",
    "EndTime": "2025-03-07T16:45:00-08:00",
    "Speakers": "Guillaume Saunier",
    "Topic": "Open Government"
  },
  {
    "Name": "Training Multi-Modal ML Classification Models for Real-Time Detection of Debilitating Disease",
    "Description": "This session breaks down the training process of multi-modal machine learning models for real-time detection of debilitating diseases using video and audio data. Attendees will learn how to build and integrate video and audio classifiers, curate multi-modal datasets, and deploy these models in real-world settings. The session includes practical demonstrations and code samples to help participants implement their own multi-modal classification models, equipping them with tools and methodologies to apply in the healthcare industry or other fields requiring complex real-time detection.",
    "Location": "Room 211",
    "StartTime": "2025-03-07T15:45:00-08:00",
    "EndTime": "2025-03-07T16:45:00-08:00",
    "Speakers": "Nikki-Rae Alkema, David vonThenen",
    "Topic": "Applied Science"
  },
  {
    "Name": "Row-Level Security sucks. Can we make it usable?",
    "Description": "Row-Level Security (RLS) in PostgreSQL is awesome, as it allows you to isolate each user or tenant's data, lock it down and default to \"deny access\"... but it sucks because it makes assumptions about your application that are not applicable in many cases. Especially if your applications were developed without RLS in mind and you use a single app user to connect to the database, it's impossible to use RLS in any meaningful way. In this talk, we'll look at possible ways to roll out RLS that can let you take advantage of this powerful feature in the real world.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-07T15:45:00-08:00",
    "EndTime": "2025-03-07T16:45:00-08:00",
    "Speakers": "Jimmy Angelakos",
    "Topic": "PostgreSQL"
  },
  {
    "Name": "Strengthening Vulnerability Management in Cloud Development Environments",
    "Description": "In cloud-native development, managing vulnerabilities is essential for secure, scalable environments. This talk covers the key elements of an effective vulnerability management strategy, including asset tracking, SBOMs, and risk prioritization, and provides actionable insights on implementing monitoring pipelines to detect and address threats early.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-07T15:45:00-08:00",
    "EndTime": "2025-03-07T16:00:00-08:00",
    "Speakers": "Rob Fletcher",
    "Topic": "DevOpsDay LA"
  },
  {
    "Name": "JWT it like its hot!!",
    "Description": "In Kubernetes 1.30 authentication just got a whole lot hotter! Join us as we explore Kubernetes Structured Authentication Configuration, including support for multiple JWT authenticators and policy-based access control with CEL. Drop the command line argument - we’ll show you how to navigate the centralized config file approach.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-07T15:45:00-08:00",
    "EndTime": "2025-03-07T16:45:00-08:00",
    "Speakers": "Paul Yu",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Computer Vision in Your Pocket: Exploring Phone Photos with Embeddings",
    "Description": "You probably have an iPhone or Android phone that you used for pictures. Well what do all those pictures say about you or the world you live in? In this session I will show you how to use computer vision data curation to understand: are there themes in your pictures, which pictures are out of focus, which has your pet versus a QR code? This talk will include working demos, each with Github repositories that you can use later. Come to learn some of the latest AI Computer Vision techniques by using photos you can relate to.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-07T15:45:00-08:00",
    "EndTime": "2025-03-07T16:45:00-08:00",
    "Speakers": "Steve Pousty",
    "Topic": "Open Source AI"
  },
  {
    "Name": "Many Ways of Building Containers: From Manual to Transparently Built On-Demand Containers.",
    "Description": "Ever wondered how container images are organized? Are you curious why some containers take forever to load and start while other containers start right away? Did you know that \"docker build\" is not the only way to build container images? Did you know that you can build containers without Docker? Do you want to learn how to build container images without any container tools? If you answered yes to any of these questions this talk is for you! You'll learn how container images are structured and you'll learn different ways you can build container images.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-07T15:45:00-08:00",
    "EndTime": "2025-03-07T16:45:00-08:00",
    "Speakers": "Kyle Quest",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Mastering Incident Communication",
    "Description": "When launching new products or dealing with an outage, customer-facing teams see terms thrown around internally that customers might not identify with immediately. Good communication practices, including good translation of engineering terminology to customer-friendly communication, can save time and increase customer satisfaction when moments matter. Come to this talk to learn how to partner with your customer-facing teams during major incidents and build both internal and external trust along the way.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-07T16:00:00-08:00",
    "EndTime": "2025-03-07T16:45:00-08:00",
    "Speakers": "kat gaines",
    "Topic": "DevOpsDay LA"
  },
  {
    "Name": "Leveraging OpenInfra and Open Source GenAI to Address Climate Change",
    "Description": "In today's AI-driven development landscape, the OpenInfra community has a unique opportunity to lead in integrating foundational models (FMs) and AI agents into open-source workflows. By leveraging datasets and collaboration frameworks within the OnpenInfra ecosystem project teams, I have trained and fine-tuned open-source models—including LLaMA 3, SantaCoder, Mistral-7B, and OpenLLaMA-13B—to assist contributors in over 21 socio-technical tasks. These efforts have led to noticeable productivity improvements and offer a roadmap for how OpenInfra can harness AI to meet its objectives.",
    "Location": "Room 106",
    "StartTime": "2025-03-07T16:00:00-08:00",
    "EndTime": "2025-03-07T16:30:00-08:00",
    "Speakers": "Armstrong Foundjem",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Entra ID and Google IAM on Ubuntu Desktop and Server at scale with Landscape",
    "Description": "Discover how to bring Entra ID authentication on Ubuntu Desktop at scale with Landscape, Authd, and cloud-init. Join Ken VanDine and Rajan Patel.",
    "Location": "Room 103",
    "StartTime": "2025-03-07T16:00:00-08:00",
    "EndTime": "2025-03-07T17:00:00-08:00",
    "Speakers": "Ken VanDine, Rajan Patel",
    "Topic": "Ubucon"
  },
  {
    "Name": "How To Write A Vulnerability Disclosure",
    "Description": "For anyone that has ever had a job in vulnerability management, sifting through endless amounts of poorly written, ambiguous, misleading vulnerability advisories has never been a fun part of the job. Information is often withheld or left out, their descriptions are hard to understand, and sometimes they are unfortunately just plain wrong. For a long time, vulnerability databases like the NVD have been heralded as a single source of truth when they, like all things, are fallible. My aim is to bring attention to this problem, and to help security researchers.",
    "Location": "Room 105",
    "StartTime": "2025-03-07T16:00:00-08:00",
    "EndTime": "2025-03-07T16:45:00-08:00",
    "Speakers": "Max vonBlankenburg",
    "Topic": "SunSecCon"
  },
  {
    "Name": "Forum - Ironic - Something Something Cloud Native Dark Side",
    "Description": "A Forum Session to discuss the move of Ironic to better enable cloud-native workloads and use cases, and discuss other bare metal-related topics. https://etherpad.opendev.org/p/openinfra-days-la-ironic-2025",
    "Location": "Room 212",
    "StartTime": "2025-03-07T16:00:00-08:00",
    "EndTime": "2025-03-07T16:30:00-08:00",
    "Speakers": "Julia Kreger",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Introduction to Vitess - Open Source Sharding framework for MySQL",
    "Description": "Vitess is an open-source database solution for deploying, scaling, and managing large clusters of MySQL instances. It was designed to support high levels of read and write traffic for applications that need to scale horizontally across many servers.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T18:00:00-08:00",
    "Speakers": "Matthias Crauwels",
    "Topic": "MySQL"
  },
  {
    "Name": "Adding API Security to your DevSecOps Toolbelt",
    "Description": "DevOps tooling and CI/CD pipelines manage product release cycles while Dev Ops teams work well together. A DevSecOps transformation to Shift Left and test code security in pipelines has begun. But how do you integrate Security teams into DevOps to achieve true DevSecOps? Then, how do you integrate APIs, as they are behavior-based? Traditional AppSec can’t identify vulnerabilities in API consumption. Learn how to bring API testing into DevSecOps to improve MTTR and keep your teams happy!",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T17:45:00-08:00",
    "Speakers": "Scott Bly",
    "Topic": "DevOpsDay LA"
  },
  {
    "Name": "Infrastructure as Code 3 Ways",
    "Description": "Infrastructure-as-Code (IaC) allows engineers to manage infrastructure through code, ensuring a safe, consistent, and repeatable process. As IaC gains popularity, various tools have emerged to support it. In this session, aimed at DevOps, SRE, and Platform Engineering professionals, Adriana and Ana will explore and compare three open-source IaC tools: Pulumi, Crossplane, and OpenTofu, helping attendees understand the capabilities of these tools and choose the one that best fits their needs.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T18:00:00-08:00",
    "Speakers": "Adriana Villela, Ana Margarita Medina",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Is Vector Search Right for Me?",
    "Description": "Is the term \"AI\" obfuscating every practical conversation about everything? Can we cut through the noise and ride this wave by understanding, designing, and deploying a new breed of search, fully integrated with your existing data and database? Yes, yes, we can! This talk will dig into the weeds of vector search. We'll explore both the core math of the technology, as well as the applicability to a wide variety of use cases. We'll differentiate it from preceding search technologies and find how it fits within an overall data retrieval strategy.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T18:00:00-08:00",
    "Speakers": "Nuri Halperin",
    "Topic": "Open Source AI"
  },
  {
    "Name": "To accrue additional technical debt, turn to page 52! A choose-your-own-adventure system design case study.",
    "Description": "Designing complex, integrated systems is a challenge with so many products available in the cloud native open source world. This talk aims to discuss a team’s recent experience building out a new system, and the choices made to build an automatable, scalable, and stable environment.This talk will be delivered in a “choose your own adventure” format, where we discuss the different OSS options that were considered and their implementation. As we work with the audience through different options, we will encounter the benefits/consequences of our choices.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T18:00:00-08:00",
    "Speakers": "Amber Salome, Éamon Ryan",
    "Topic": "Cloud Native"
  },
  {
    "Name": "How Not to Go Bankrupt (and Look Foolish): Mastering Transactions in MySQL",
    "Description": "How do we know that concurrent data modifications don't introduce corruption? From double-booked plane seats to crypto exchange bankruptcy, these errors can be costly. MySQL offers transaction isolation levels that balance performance and isolation guarantees. With live demos, we'll learn all about transactions, consistent nonlocking reads, InnoDB locking and MVCC, read phenomena, and isolation levels. After this talk, you'll be able to spot and fix concurrency bugs in MySQL queries, and make informed decisions about performance tradeoffs in transactions.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T18:00:00-08:00",
    "Speakers": "Mikaël Francoeur",
    "Topic": "MySQL"
  },
  {
    "Name": "Panel: Public tech stacks that work for all",
    "Description": "Government agencies have a duty to serve the public. How do we ensure our digital services are usable by those who need them most? In this panel talk, folks at different levels of government will discuss the benefits, challenges and constraints of using public code, open source systems, and open data to design and build tech stacks that serve the public.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T18:00:00-08:00",
    "Speakers": "Chach Sikes, Nina Kin",
    "Topic": "Open Government"
  },
  {
    "Name": "CliMA: A New Open Source Code for Climate Modeling",
    "Description": "This talk will focus on the development of an open-source Earth System Model (ESM) by the Climate Modeling Alliance (CliMA), which aims to address the limitations of existing, outdated ESMs that are computationally expensive and not readily publicly accessible. CliMA's model is being built from scratch to be less resource-intensive while maintaining scientific accuracy, making it more useful to the broader scientific community. The talk will highlight the benefits of providing such a model as open source to support climate research and collaboration.",
    "Location": "Room 211",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T18:00:00-08:00",
    "Speakers": "Julia Sloan",
    "Topic": "Applied Science"
  },
  {
    "Name": "Unleashing AI with OpenInfra: The Future of Open Source in Artificial Intelligence",
    "Description": "As AI adoption accelerates across industries, organizations are seeking infrastructure solutions that meet the unique demands of AI workloads without locking them into proprietary ecosystems. OpenInfra solutions are emerging as a powerful alternative to traditional platforms, enabling scalable, flexible, and cost-efficient AI infrastructure. This expert-led panel will delve into how open source technologies are addressing the infrastructure needs of AI while fostering collaboration and reducing reliance on proprietary systems.",
    "Location": "Room 106",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T17:45:00-08:00",
    "Speakers": "Allison Price, Armstrong Foundjem, Todd Robinson, Kevin Carter",
    "Topic": "OpenInfra Days"
  },
  {
    "Name": "Ubuntu Q&A and Closing Remarks",
    "Description": "Bring all your pressing Ubuntu questions for a lively and friendly Q&A with long time Ubuntu Members and SCaLe community organizers, Nathan Haines and Richard Gaskin.",
    "Location": "Room 103",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T17:30:00-08:00",
    "Speakers": "Nathan Haines, Richard Gaskin",
    "Topic": "Ubucon"
  },
  {
    "Name": "That One Time the Threat Actor Sent Me His Token",
    "Description": "We all know honeypots can reveal interesting details about threat actors and there tactics, but it’s not every day that a threat actors sends you their own credentials. Operational security is hard. In this session, I’ll share how my team and I developed a simple Flask application to emulate an exposed Docker endpoint, and how an everyday log review led to discovery the X-Registry-Auth header. The header turned out to be a DockerHub token. I’ll take you down the rabbit-hole on how my team and I pivoted for additional research and derived some level of attribution.",
    "Location": "Room 105",
    "StartTime": "2025-03-07T17:00:00-08:00",
    "EndTime": "2025-03-07T17:45:00-08:00",
    "Speakers": "Andy Giron",
    "Topic": "SunSecCon"
  },
  {
    "Name": "UpSCALE",
    "Description": "UpSCALE is a set of lightening talks held at SCALE, in the style of Ignite presentations. Speakers will get 5 minutes to enlighten the audience. Slides will auto-advance while chosen speakers deliver their message, a brief story of open source deliciousness. The format makes for a fast paced, fun event for participants and audience. Please join us as members of the Free and Open Source community do their best to beat the clock and get their ideas out! Want to be an UpSCaLE speaker? Email your proposal to hannah@socallinuxexpo.org.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-07T18:30:00-08:00",
    "EndTime": "2025-03-07T19:30:00-08:00",
    "Speakers": "Hannah Anderson",
    "Topic": "UpSCALE"
  },
  {
    "Name": "Solarpunk Developers Group",
    "Description": "An interdisciplinary community-building \"birds of a feather\" session for makers, designers, and homesteaders to share and discuss open source hardware (OSHW) projects with a focus on regenerative ecology. Such OSHW projects may include, but not limited to, food production, rainwater collection & filtration, energy harvesting & storage systems, as well as development methodologies.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-07T18:30:00-08:00",
    "EndTime": "2025-03-07T19:30:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Libre Graphics, Media, and Design",
    "Description": "If you use free software for your creative pursuits ­— art, design, 3D, video, music, photos, typography, painting, or anything else — join us to talk about the community and projects that live in this space. Questions, networking, sharing what you make, musing about the future: all are welcome!",
    "Location": "Ballroom F",
    "StartTime": "2025-03-07T18:30:00-08:00",
    "EndTime": "2025-03-07T19:30:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Search and Analytics",
    "Description": "Anyone interested in search, including full-text or vector search, or analytics software",
    "Location": "Ballroom G",
    "StartTime": "2025-03-07T18:30:00-08:00",
    "EndTime": "2025-03-07T19:30:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Mapping the AI Supply Chain: The Role of AIBOM in Security and Transparency",
    "Description": "AI-driven systems rely on complex supply chains of models, datasets, and dependencies, introducing unique security and governance challenges. As organizations seek better visibility into AI components, the concept of an Artificial Intelligence Bill of Materials (AIBOM) is gaining traction. This session will explore how AIBOM can enhance transparency, how it compares to traditional SBOMs, key obstacles in securing AI supply chains, and the evolving landscape of AI risk management.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-07T18:30:00-08:00",
    "EndTime": "2025-03-07T19:30:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "TinyGo Hardware Hack (Cancelled)",
    "Description": "Ever wanted to hack hardware using Go/TinyGo? This is your chance! We are bringing a special collection of our favorite IoT devices, programmable robots, and toys for you to play with/code at this hands-on BoF session. Just bring your notebook computer, we will bring the rest. Dive into drone control via joystick, reunite with our trusty pal GopherBot, and immerse yourself in more IoT wonders than you can handle.",
    "Location": "Room 208",
    "StartTime": "2025-03-07T19:15:00-08:00",
    "EndTime": "2025-03-07T21:00:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Fountain Pen Field Trip to Vroman's Bookstore",
    "Description": "What better way to remember SCaLE than picking up a fountain pen, bottle of ink, or other fun writing accessory with your fellow open source and free software fans! Whether you're thinking of getting your fiftieth pen or your first, we'll head to Vroman's Bookstore, a fifteen minute walk from the Convention Center, and their impressive pen and stationery section. Optional dinner after the field trip for anyone interested sharing fountain pen enthusiasm and community over food.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-07T20:00:00-08:00",
    "EndTime": "2025-03-07T21:00:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "International Women's Day Fun Walk (Offsite)",
    "Description": "Join us for a fun walk through Pasadena on a lovely Saturday morning as we celebrate International Women's Day. Meet: in front of the main entrance to the Pasadena Convention Center Introductions. Stretch. Then we go. You will be led by a seasoned runner (who actually founded & currently organizes a run club in Los Angeles). Expect to be back at our starting location shortly after 9am.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-08T08:00:00-08:00",
    "EndTime": "2025-03-08T09:00:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Linux Training Class - Day 1",
    "Description": "Linux is a robust and secure operating system with a rich array of applications. SCALE is once again providing those who want to start using Linux an opportunity to learn how. SCALE will provide an installfest plus basic system administration class to help you hit the ground running with Linux. The class will be offered as an Installfest on Saturday, morning March 8, and a full day of training on Sunday 9th. Advanced registration is required.",
    "Location": "Room 208",
    "StartTime": "2025-03-08T09:30:00-08:00",
    "EndTime": "2025-03-08T13:00:00-08:00",
    "Speakers": "Tom King",
    "Topic": "Workshops"
  },
  {
    "Name": "Robots building Robots",
    "Description": "Everyone’s talking about AI writing code. But what about AI shipping code? How will LLMs change how we build, test and deploy software? Will Devops as we know it continue to exist? Will our favorite tools become obsolete, or endure? And hat about us, the platform builders? Is this our golden age, or the beginning of the end? In this talk, Solomon Hykes, creator of Docker and co-founder of Dagger.io, takes us on a journey through time, as we retrace the history of software’s industrial revolution, and explore the ramifications of the AI revolution for our community.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-08T10:00:00-08:00",
    "EndTime": "2025-03-08T11:00:00-08:00",
    "Speakers": "Solomon Hykes",
    "Topic": "Keynote"
  },
  {
    "Name": "Gotchas of Everyday Systemd",
    "Description": "When working with systemd there can be edge cases or \"gotchas\" that run counter to how you think systemd should behave. In this talk we'll go over a couple of them and suggestions on how to resolve or work around such situations.",
    "Location": "Room 106",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Anita Zhang",
    "Topic": "Systems & Infrastructure"
  },
  {
    "Name": "Observability at Tigris Data",
    "Description": "Tigris is a globally distributed S3 compatible object storage, where buckets are no longer tied to a region. In this talk, we share our journey about how we use metrics, traces and logs.",
    "Location": "Room 107",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Peter Boros",
    "Topic": "Observability"
  },
  {
    "Name": "Scalable and Low Latency Lock-free Data Structures",
    "Description": "* when standard containers and locking mechanisms aren't enough* several advanced data structures: split ordered lists and other variations of lock-free hash tables, tries (partricia trees) and hybrid data structures* x86-64 memory ordering and cache hierarchy, operating system preemption and how to employ all the knowledge to implement a very fast data structure* gotchas of data structures benchmarking, such as keys distribution, latency vs throughput, worst cases and so on* an open source lock-free cache conscius Hash Trie implementation",
    "Location": "Room 211",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Alexander Krizhanovsky",
    "Topic": "Developer"
  },
  {
    "Name": "Evolving a DSL: How bpftrace makes language design decisions",
    "Description": "On its face, bpftrace is a simple DSL/tracing-tool for writing BPF programs. It abstracts away a lot of the complicated user and kernel space code neccessary to write observability and debugging programs. However, adding new language features/syntax isn't easy. There are a lot of considerations to be made in regards to bpftrace's primary usecases and the classic problem of how much complexity/details to hide from the user.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Jordan Rome",
    "Topic": "Kernel & Low Level Systems"
  },
  {
    "Name": "GitOps best practices using Argo CD",
    "Description": "Kubernetes is a declarative-first platform where manifests written in YAML describe what resources should exist in the cluster and on the nodes. Yet many new users will use imperative processes, running `kubectl apply` either manually or through CI, to define and change the state of their cluster. This approach is known as the “push” model, and while it works initially, it does not scale as more users adopt the platform. Without a shared understanding of the desired state, it’s impossible for teams to collaborate and make changes safely.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Justin Marquis, Christian Hernandez",
    "Topic": "Cloud Native"
  },
  {
    "Name": "How to do Everything in a Terminal",
    "Description": "Graphical interfaces are bloated and bog down your system. Free yourself from the GUI by liberating yourself at the CLI. Learn how to do all the things you thought you needed a GUI for in the terminal, such as watching Youtube videos, reading and editing MS Office documents and replacing MS Word, Excel and Powerpoint, listening to music, browse the modern Internet including images, staying up-to-date and interact on social media, check your email, play games and so much more. Keep your New Year's resolution by dumping that GUI weight and run lean and mean in the CLI.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Jared Bernard",
    "Topic": "General"
  },
  {
    "Name": "Making Linux From Scratch",
    "Description": "This October, I started following along with Linux from Scratch by Gerard Beekmans with the hopes of constructing my own Linux distribution. As with most things computer-related, the simple process I expected turned out to be a tedious, complex, and tiresome one, especially for a relatively inexperienced Linux user like myself. Join me as I tell the story of how I finally made my distribution and try to show the outstanding benefits \"doing it yourself\" can have with respect to computers and beyond.",
    "Location": "Room 103",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:00:00-08:00",
    "Speakers": "August Cho",
    "Topic": "Next Generation"
  },
  {
    "Name": "Shining Light on the Open Source Supply Chain: The Risk in Community Health",
    "Description": "Organizations rely on open-source software to accelerate development and reduce costs. However, the health of the communities behind these projects is often overlooked, posing significant risks to the overall supply chain. This talk introduces a risk model implemented in the open source GrimoireLab tool to analyze open source software dependencies at scale.",
    "Location": "Room 101",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Georg Link",
    "Topic": "Security"
  },
  {
    "Name": "Source Available is Thriving but Open Source is Dying",
    "Description": "Source available software is thriving; more than ever, the entire world runs on OSS. We won, right? Despite the success, maintainer burnout is worse than ever, support is low, and funding has dried up at an alarmingly fast rate. While the situation isn’t hopeless, it is urgent, and this problem doesn't come with neatly packaged solutions. There are people and programs working to reverse the course, but heightened awareness is desperately needed. Right now, things are bad, and they’re getting much worse. We can’t delay any longer; for many, it’s already too late.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Hazel Weakly",
    "Topic": "General"
  },
  {
    "Name": "Baking a TuringPi in the Home Lab",
    "Description": "This talk details my journey building a home lab using the TuringPi, Talos Linux, and Kubernetes. Attendees will learn what the TuringPi is, how to flash an operating system to its nodes, how to use Talos Linux to deploy and manage Kubernetes, and how to observe it all with OpenTelemetry. We'll discuss the gotchas of ARM and the TuringPi and what I wish to see released next. All current and future home labbers welcome!",
    "Location": "Room 105",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Matthew Sanabria",
    "Topic": "FOSS @ HOME"
  },
  {
    "Name": "Rethinking the Container Layer with Nix",
    "Description": "How many layers can you put in a container?Do you know why there's a limit?Containers are a fantastic virtualization technology.They even have some packaging properties! However, we can learn a lot of new cloud-native magic tricks if we bring packaging discipline a little further through the stack of bits that make up our container image layers and OCI manifests. Nix uses stores that isolate packages into hashed folders that can be used independently from each other and combined with each other! Sounds a lot like a container registry, doesn't it?",
    "Location": "Ballroom A",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Leigh Capili, Tom Bereknyei",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Enhancing Occupational Classification and Seniority Prediction from Job Descriptions Using Open-Source Tools and Embedding Techniques",
    "Description": "Accurate job classification is essential for understanding labor market trends and informing policy decisions, but modern job descriptions are complex and varied. We explore how open-source AI tools like PyTorch and HuggingFace models can improve mappings of Standard Occupational Classification to job descriptions. Using these technologies, we develop methods to better interpret and classify unstructured job data, leading to more precise occupational analysis. Join us to learn how open-source AI can enhance workforce analytics and how you can apply these tools in your own projects.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-08T11:15:00-08:00",
    "EndTime": "2025-03-08T12:15:00-08:00",
    "Speakers": "Sinan Kefeli",
    "Topic": "Open Source AI"
  },
  {
    "Name": "Smarter Ways to Stay Safe Online by Building Better Passwords",
    "Description": "Strong passwords are essential to keeping personal information safe, especially online. Studies show that weak passwords contribute to around 80% of data breaches, meaning most security issues are due to easy-to-guess passwords. Using simple or common passwords like \"123456\" or \"password\" makes it much easier for hackers to break into accounts. A strong password, ideally a mix of letters, numbers, and symbols, can prevent most of these problems. Fun fact: a password with 12 random characters would take millions of years for a hacker to guess!",
    "Location": "Room 103",
    "StartTime": "2025-03-08T12:15:00-08:00",
    "EndTime": "2025-03-08T12:45:00-08:00",
    "Speakers": "Andrew Lim",
    "Topic": "Next Generation"
  },
  {
    "Name": "Advanced SRE: Networking",
    "Description": "In the rapidly evolving landscape of 2024, Site Reliability Engineering (SRE) continues to play a pivotal role in scaling and maintaining resilient, high-availability systems. This talk delves into the critical networking knowledge that every SRE should possess to effectively manage and debug large-scale internet facing infrastructure. - Overview of Linux Networking - Overview of LAN concepts - Overview of DNS - Overview of TCP/IP - Overview of Internet Security - Overview of Internet Routing - Overview of Linux Network Debugging tools",
    "Location": "Room 106",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Patrick Shuff",
    "Topic": "Systems & Infrastructure"
  },
  {
    "Name": "Keeping Things Local - Making Your Own Private LLM",
    "Description": "Ever wanted your own private version of ChatGPT? LLMs offer powerful capabilities, but not everyone is comfortable sending their data over the internet to Microsoft, OpenAI, or Anthropic. Fortunately, open-source tools make it possible to set up and customize a local, secure LLM on your own terms. From installation to optimization, this talk will guide you through the process step by step, with demos to illustrate each stage. It’s time to build your own mini-Jarvis and start getting things done, efficiently, securely, and privately.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Bronwen Aker",
    "Topic": "Open Source AI"
  },
  {
    "Name": "Are we really making the most of our smart home technology?",
    "Description": "Take the skills you already have to elevate your home automation beyond simple convenience, by automating daily chores or adding smart detection systems.",
    "Location": "Room 105",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Joyce Lin",
    "Topic": "FOSS @ HOME"
  },
  {
    "Name": "APIs for the Modern World",
    "Description": "Modern day APIs sometimes feel like demos for the main product, but it doesn't have to be that way. Developers continue to innovate by providing new sources of useful data that inspire creative new projects. In this talk, Addison Hart, a reverse engineer and data scientist with experience in geospatial, video game APIs and many others, will talk about what he has learned about making APIs, both from operating them and picking apart existing ones while reverse engineering. He will discuss API latency, quantity, coverage and quality and how these 4 aspects contribute to an APIs effectiveness.",
    "Location": "Room 211",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Addison Hart",
    "Topic": "Developer"
  },
  {
    "Name": "Scalable Open Source Data Science on Bare Metal Kubernetes",
    "Description": "By utilizing DevOps and cloud-native strategies, UCSB's College of Letters and Science hosts JupyterHub instances for over 50 courses and over 4600 persistent individual developer environments per year in baremetal Kubernetes environments. This talk will highlight the methods to accomplish this from provisioning servers on immutable Linux to git-based CI driven pipelines for managing container images and deployment lifecycles, all using open source tools.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Scott Williams",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Managing Infrastructure for Confidential AI using OpenStack",
    "Description": "Confidential Computing is a technology that enables processing of sensitive data in a secure enclave that is a Hardware based trusted execution environment (TEE). With this technology, data in use becomes inaccessible to even internal administrators, thus enabling technical assurance of data security instead of operational assurance. In this session, we will cover how OpenStack can be used as a cloud control plane to manage a Confidential Computing Infrastructure, its provisioning and life cycle management.",
    "Location": "Room 101",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Divya KK, Srirama Sharma",
    "Topic": "Security"
  },
  {
    "Name": "Better latency with fewer servers: avoiding RAM noisy neighbors",
    "Description": "In cloud-native environments, application performance often degrades due to contention over shared resources such as CPU caches and memory bandwidth. Current container technologies do not isolate these resources, which compels operators to maintain low utilization by scaling out their deployments. This session will show how memory noisy neighbor degrades application performance, survey strategies used in production by Google and Alibaba Cloud to mitigate such performance interference, and discuss community efforts, highlighting the memory-collector observability project.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Jonathan Perry",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Choose your benefactor: Common Good or Corporate Good",
    "Description": "The adoption of open source software is on the rise across all industries, but what 'open source' means (even if they use the right licenses) is getting muddier and muddier. It can be hard to know for sure whether your efforts will benefit a corporation, a community, or both. In this talk you will get a crash course on open source licensing, the differences and similarities in open source projects depending on who's funding it, the different ways you can engage with the types of projects, and how to decide what type of project you want to work on.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "benny Vasquez",
    "Topic": "General"
  },
  {
    "Name": "Writing Production Ready Schedulers using Sched Ext",
    "Description": "In this talk, Jake and Pat will provide a brief user oriented overview of Sched Ext. They will then go over how to use the Sched Ext primitives discussed to author a production ready scheduler, covering interesting challenges, concepts and solutions involved they have come across while working on multiple such schedulers here: https://github.com/sched-ext/scx .",
    "Location": "Ballroom C",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Jake Hillion, Daniel Hodges",
    "Topic": "Kernel & Low Level Systems"
  },
  {
    "Name": "Taming the Chaos: What's Next in Engineering",
    "Description": "Join us for \"Taming the Chaos: What's Next in Engineering?\" where top tech leaders discuss strategies to streamline development and anticipate future shifts in the realms of open source and AI. This panel, featuring luminaries like Kelsey Hightower, Michael Stahnke (VP Eng at Flox, ex VP at Circle CI), Katherine Druckman (Open Source Security @ Intel) and Ron Efroni (Founder of Flox), will explore effective ways to manage the growing complexity in tech stacks and highlight how AI, open source, and security trends are shaping the future of engineering.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Ron Efroni, Michael Stahnke, Kelsey Hightower, Katherine Druckman",
    "Topic": "General"
  },
  {
    "Name": "Profiling and beyond: scaling observability with Fluent Bit and eBPF",
    "Description": "As observability evolves to provide deeper performance insights through profiling and eBPF, Fluent Bit continues to push the boundaries of data collection and processing. This session will cover everything from traditional logs, metrics, and traces to profiling with eBPF: one of the latest signal additions in Fluent Bit.",
    "Location": "Room 107",
    "StartTime": "2025-03-08T12:30:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Eduardo Silva",
    "Topic": "Observability"
  },
  {
    "Name": "Scam–Spotting 101: How to Identify Phishing and Fake Messages",
    "Description": "Have you ever gotten a weird email or message that didn’t seem right? In our talk, “Scam-Spotting 101: How to Identify Phishing and Fake Messages,” We’ll share information about how to spot suspicious messages, emails, and websites so you don’t get tricked. Phishing is one of the most common scams, where attackers pretend to be someone you trust.",
    "Location": "Room 103",
    "StartTime": "2025-03-08T13:00:00-08:00",
    "EndTime": "2025-03-08T13:30:00-08:00",
    "Speakers": "Jonah Ibarra, Eisly Morales",
    "Topic": "Next Generation"
  },
  {
    "Name": "The Research Software Engineering Revolution",
    "Description": "Research Software Engineering (RSE) is emerging as a critical bridge between scientific research and software development. This talk will introduce the discipline of Research Software Engineering and highlight how it accelerates discovery and foster collaboration by embracing open source principles. I will also discuss how RSE career paths are evolving, the challenges faced by modern research environments, and the pivotal role open-source ecosystems play in advancing scientific innovation.",
    "Location": "Room 211",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "Gabriele Bozzola",
    "Topic": "Developer"
  },
  {
    "Name": "Universal Blue: Delivering Experiences Using Bootable Containers",
    "Description": "In this talk, I will be discussing the Universal Blue Project. The Universal Blue project builds custom bootable container images via OCI/Docker containers. The project publishes a diverse set of base images and tooling for users to develop their own custom images. We will be explain how the project builds images and why we feel this model is the future of Linux.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "Noel Miller",
    "Topic": "Cloud Native"
  },
  {
    "Name": "A simpler and faster firewall with bpfilter",
    "Description": "What if your firewall could be faster while using fewer resources? Coupling widely available solutions (nftables, iptables) with bleeding-edge technologies (BPF), bpfilter aims to simplify firewalls and bring better performance to everyone.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "Quentin Deslandes",
    "Topic": "Kernel & Low Level Systems"
  },
  {
    "Name": "MapLibre: An Introduction to Its Use and Its Community",
    "Description": "The ability to provide useful maps is a key feature for many applications, but using commercial services like Google Maps or Mapquest can be expensive and limiting. MapLibre provides a robust and flexible mapping library for both web use (using Typescript) and native mobile operating systems (using C++ and wrappers) and it is completely open source. The MapLibre community is also very active and transparent, insuring that the project will continue and grow in the future,",
    "Location": "Ballroom G",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "Tarus Balog",
    "Topic": "General"
  },
  {
    "Name": "Meshing Your Way to Better Observability",
    "Description": "The implemented solution is based on the idea of injecting headers along the way for each of the mesh components. The latency is measured by Envoy sidecars on the request flow, and measurements are injected into it. By subtracting between measurement values, we can isolate and construct fitted histograms, and thus, we can allow high accuracy, which contributes to early incident detection time.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "Ram Ellupuru, Boaz Ardel",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Modernizing Systems Observability with AI and LLMs",
    "Description": "Organizations face mounting challenges managing the vast data their systems generate, and traditional monitoring often struggles to keep up with this complexity. This session explores how AI and Large Language Models (LLMs) are transforming observability by automating data analysis, detecting anomalies, streamlining interactions, and supporting post-incident learning. Through real-world examples, we’ll see how AI-driven observability uncovers hidden patterns, reduces false alarms, and accelerates correlation discovery, enabling faster, more accurate issue resolution and a clearer understanding",
    "Location": "Room 107",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "Jason Hand",
    "Topic": "Observability"
  },
  {
    "Name": "Navigating Security in Generative AI Development",
    "Description": "As generative AI moves into production, developers face unprecedented security challenges beyond traditional approaches. This session examines how groups like OpenSSF and OPEA are developing frameworks and best practices for GenAI security. Learn about emerging threat taxonomies, practical security patterns, and community-driven initiatives addressing concerns from prompt injection to model supply chain security. Gain insights into work-in-progress standards being shaped by open source collaboration, and discover how to apply these evolving best practices to secure your GenAI applications.",
    "Location": "Room 101",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "Katherine Druckman",
    "Topic": "Security"
  },
  {
    "Name": "The JOY of Free Software: It should be fun to fish",
    "Description": "There was a time when people wrote software for their own needs. Knowing that selling software is hard (and to a very small market compared to today's markets) they shared their software with \"Birds of a Feather\" to help others who neeed it.Over time, markets grew and the desire to make money pulled the making of software from being fun to being a (sometimes mind-numbing) job.Can we Make Software Fun Again? (MSFA)?",
    "Location": "Ballroom H",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "maddog Hall",
    "Topic": "General"
  },
  {
    "Name": "AI-Powered Searches with Cassandra",
    "Description": "Step into the world of AI-driven data solutions with our focused session on semantic search using Apache Cassandra. We're cutting through the noise to show you how the current capabilities of Cassandra align with the demands of natural language processing and AI systems. Whether you're managing large datasets or looking to infuse AI into your data strategy, join us to see how Cassandra stands up to the task now and how it's gearing up for an even more efficient future.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "Bassam Chahine",
    "Topic": "Open Source AI"
  },
  {
    "Name": "99 package problems",
    "Description": "Package maintenance is an often underappreciated area. A binary package is an archive, like a tarball plus metadata that includes the package name, version, depends, etc. and often {pre,post}-install, and post-removal scripts - for ldconfig, creating symlinks, or updating a database. Even a small oversight can prevent installation via dependency hell or file conflicts, break apt/dnf/zypper, or even corrupt the repository. This talk will cover the experience as a .deb and .rpm package and repo maintainer, debug common package manager errors and how to solve them.",
    "Location": "Room 106",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "Kevin Mittman",
    "Topic": "Systems & Infrastructure"
  },
  {
    "Name": "What the Heck is KiCad, and Can I Really Make My Own Electronics?",
    "Description": "KiCad has been one of those workhorse tools used by those in the know, but perhaps scary and intimidating for those who haven't tried it (and maybe some who have). It is described as \"A Cross Platform and Open Source Electronics Design Automation Suite\", but what exactly does that mean, and how can it help you? This session will present my trials and tribulations attempting to use it to initially to track an arduino project through to ending up with industry manufactured boards and custom 3d printed housings. Failures surely will abound so that you can learn through the pain of others.",
    "Location": "Room 105",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:30:00-08:00",
    "Speakers": "Jon Cruz",
    "Topic": "FOSS @ HOME"
  },
  {
    "Name": "Be Your Own AWS",
    "Description": "Hosting a server doesn't have to cost a ton of money. Normally you'd rent out a tiny portion of a server stack in a building somewhere, paying per month for a server plan, but that doesn't have to be the case. Any device with even a little bit of computing power and access to the internet can be converted into a server, like that old office desktop sitting around just waiting to be dumped. The goal of this session is to talk about the differences between a LAN and a WAN, how servers work, and ultimately provide the knowledge and tools necessary to make your own home server from scratch.",
    "Location": "Room 103",
    "StartTime": "2025-03-08T14:30:00-08:00",
    "EndTime": "2025-03-08T15:15:00-08:00",
    "Speakers": "Brady Hancock",
    "Topic": "Next Generation"
  },
  {
    "Name": "Building Community and Social Capital on the Internet",
    "Description": "Open-access communications platforms on the Internet have made building social capital more critical than ever for connected digital citizens. Focusing on the Discord platform, this presentation explains the effectiveness of its features in making community building and social capital accessible for users. As online communities continue to rise in popularity and usage, digital leadership becomes ever more important and valuable. Join Alex Moral to learn more about key principles in building social capital online, starting a community from scratch and becoming a digital leader.",
    "Location": "Room 103",
    "StartTime": "2025-03-08T15:15:00-08:00",
    "EndTime": "2025-03-08T16:00:00-08:00",
    "Speakers": "Alexander Moral",
    "Topic": "Next Generation"
  },
  {
    "Name": "Access self-hosted services securely from anywhere",
    "Description": "Find out how to share any self-hosted service, running anywhere in the world, behind almost any kind of NAT, with friends and family without exposing your stuff to the internet.",
    "Location": "Room 105",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Alex Kretzschmar",
    "Topic": "FOSS @ HOME"
  },
  {
    "Name": "The best of both worlds: building R / Python pipelines for biomedical LLM semantic search apps",
    "Description": "At the CELEHS laboratory we are particularly interested by LLM-based embeddings as BGE and BERT. As the number of models increases, we need methods to compare their clinical usefulness. While some R packages exist to leverage GPU capabilities, Pytorch is by far more used for GPU computation. In contrast, R is efficient for data management and visualization. How should one build robust and reproducible pipelines incorporating them both ? My answer is well-designed pipelines with Docker, Makefile, and Elasticsearch. In this talk I will showcase my design approaches to such challenges.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Thomas Charlon",
    "Topic": "Open Source AI"
  },
  {
    "Name": "Exemplars - A Tale of Pillars Supporting The Observability Structure",
    "Description": "We are used to calling Metrics, Logs, Events, Traces as the 4 pillars of Observability. True Observability is not attainable without being able to jump from one pillar to another. Exemplars promote the same from Metrics to Traces. Over the years, we have found extreme value in being able to use Exemplars for other things such as making tail sampling decisions, enriching alerts with sample traces and finally serving longer term Exemplars out of our tracestore built on top of ClickHouse. In this talk, we discuss how metrics and traces go hand in hand through the concept of Exemplars.",
    "Location": "Room 107",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Vijay Samuel, Jing Hu",
    "Topic": "Observability"
  },
  {
    "Name": "Cloud Native Technologies: The Building Blocks of Modern Database Software",
    "Description": "Learn how cloud-native technologies like Kubernetes are revolutionizing database software, enabling scalability, resilience, and agility. Join Divine, a Data on Kubernetes Ambassador to explore real-world examples and best practices for building the next generation of database solutions.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Divine Odazie",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Kubernetes as a Geographically Distributed System",
    "Description": "Learn about how StarlingX takes well-known open source platforms, such as Kubernetes and OpenStack, and enables them to build geographically distributed infrastructure for the most demanding use cases, like 5G and telecommunications netoworks, industrial IoT, and more. This session will highlight how the platform takes datacenter building blocks and provides users with the ability to manage them remotely, as one large system on a massive scale. The audience will also learn what is new in the latest, 10.0 release and get an early seek peak into the 11.0 roadmap.",
    "Location": "Room 106",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Ildiko Vancsa",
    "Topic": "Systems & Infrastructure"
  },
  {
    "Name": "Kernel observability using eBPF made easy and approachable with Inspektor Gadget",
    "Description": "Kernel level observability is critical for running resilient workloads. eBPF provides that visibility but can be challenging to learn. In this presentation we will introduce eBPF and demonstrate how to harness its superpowers for observability using the open source project Inspektor Gadget. Inspektor Gadget is a tool and framework for data collection and system inspection on Linux hosts and Kubernetes clusters using eBPF. We will show how its modular framework can collect real time metrics so that you have visibility into the Linux kernel in a customizable way.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Maya Singh, Jose Blanquicet",
    "Topic": "Kernel & Low Level Systems"
  },
  {
    "Name": "The Future is Real-Time Data",
    "Description": "Data flows continuously—and so should your analyses. In this session, learn about the fundamentals of stream processing and how it’s transforming industries like finance, e-commerce, and IoT. We'll dive into commonly used, open-source tools like Kafka, Flink, and RisingWave. Then we'll build out a simple data pipeline, showing how to wrangle endless data streams into manageable, actionable insights instantly. Whether you're starting out, or improving your approach, join us to learn about the potential of real-time data.",
    "Location": "Room 211",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Emily Le",
    "Topic": "Developer"
  },
  {
    "Name": "Atomic Honeypot: A MySQL Honeypot That Drops Shells",
    "Description": "Meet an attacking MySQL honepot which can “Attack the attackers”. With this atomic honeypot we were able to discover 2 new attacks against MySQL servers. Using arbitrary file read vulnerability in MySQL we were able to download and analyze the attackers' code and then execute an “attack against attackers” using a chain of exploits.",
    "Location": "Room 101",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Alexander Rubin",
    "Topic": "Security"
  },
  {
    "Name": "When Pipelines Are Code, Developers Win",
    "Description": "Brought together by a shared frustration with the confused state of CI and local dev tools for build and test, Rebecca and Jeremy will show how to build reusable CI/CD pipelines that can be written in real programming languages (not bespoke YAML) and \"just work\" together using the open source Dagger project (dagger.io).",
    "Location": "Ballroom H",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Jeremy Adams, Rebecca Dittmar",
    "Topic": "General"
  },
  {
    "Name": "The Nuances and Challenges of Moderating a Code Collaboration Platform",
    "Description": "Join us for a presentation discussing the unique considerations of moderating a code collaboration platform. Using diverse case studies, we'll look at how GitHub has refined its approach to developer-first content moderation in response to technological and societal developments as well as notable incidents on the platform. This presentation is a condensed version of the recently published T&S Research Journal article, “Nuances and Challenges of Moderating a Code Collaboration Platform” authored by members of the GitHub Trust and Safety, Legal, and Policy teams.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Margaret Tucker",
    "Topic": "General"
  },
  {
    "Name": "Breaking Free from Legacy Virtualization: Embracing KubeVirt for Cloud-Native Workloads",
    "Description": "In this session, we'll explore why KubeVirt offers a more future-proof and scalable option for organizations seeking to modernize their infrastructure. We'll dive deep into the benefits of moving away from legacy systems, how KubeVirt enables seamless integration of virtual machines into Kubernetes, and what this means for managing hybrid workloads. Attendees will gain practical insights into the advantages of unifying their compute strategy under Kubernetes, including easier automation, improved resource efficiency, and better alignment with cloud-native practices.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-08T15:45:00-08:00",
    "EndTime": "2025-03-08T16:45:00-08:00",
    "Speakers": "Fabrizio Sgura",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Euphony Echo: Integrating Virtual Reality, Machine Learning, and Music Therapy to Enhance Emotional Expression and Anxiety Management for Individuals with Autism Spectrum Disorder",
    "Description": "Euphony Echo is a VR app making music therapy accessible for individuals with autism, supporting emotional expression, anxiety management, and communication. Users explore songs backstage, perform on a safe virtual stage, and receive real-time pitch feedback via an advanced Vocal Engine. By blending technology and therapy, Euphony Echo fosters confidence, reduces anxiety, and bridges gaps in traditional music therapy access.",
    "Location": "Room 103",
    "StartTime": "2025-03-08T16:15:00-08:00",
    "EndTime": "2025-03-08T17:00:00-08:00",
    "Speakers": "Alana Wu",
    "Topic": "Next Generation"
  },
  {
    "Name": "Bazzite: Building the Future of Linux Gaming Together",
    "Description": "In this talk, We will be discussing our project Bazzite. Bazzite is an open source custom operating system image built upon Fedora Atomic Desktops that brings the best of Linux gaming to all of your devices - including your favorite handheld. It is built with Cloud Native Technology through the use of OCI containers and GitHub. It is built for Linux newcomers and enthusiasts to provide the best user friendly experience for playing your favorite video games. Come see the lessons we have learned and apply them to your project!",
    "Location": "Room 105",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Kyle Gospodnetich, Noel Miller",
    "Topic": "FOSS @ HOME"
  },
  {
    "Name": "Confessions of an ADHD-fueled technologi... SQUIRREL!!!",
    "Description": "Come along on this ADHD-fueled journey as Jeremy tells _some_ of his journey in tech, all while trying to stay on topic. He’ll dive into some of his early days “hunting squirrels” while also keeping the local librarians employed. He’ll also touch on his experiences through the early days of the internet (not ARPANET, but the “world wide web”) and how he learned to “cope” with this thing called ADHD, without _really_ coping with it, until he had to. You’ll hopefully laugh, probably cry, and that will just be from having to listen to him try to stay on topic.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Jeremy Meiss",
    "Topic": "General"
  },
  {
    "Name": "SpiceDB: Authorization that Scales",
    "Description": "As more folks deploy cloud-native architectures and technologies, store ever larger amounts of data, and build ever more complex software suites, the complexity required to correctly and securely authorize requests only becomes exponentially more difficult. Broken authorization now tops OWASP's Top 10 Security Risks. Their recommendation? Adopt ReBAC authorization models. This talk establishes the problems with the status quo, explains the concepts behind ReBAC, and introduces SpiceDB, a widely adopted open source ReBAC system inspired by the system internally powering Google: Zanzibar",
    "Location": "Room 101",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Jimmy Zelinskie",
    "Topic": "Security"
  },
  {
    "Name": "Using Nix to build pretty small images",
    "Description": "We've all probably encountered the following scenario at least once. We start pulling a container, and have to wait a solid 4–5 minutes... Why? Oh, our colleague decided to put all the development and building tools inside the container, making it >5 GB in size. Let me show you a way to construct images that prevent this from happening, and maybe teach you a thing or 2 about Nix in the process.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Bryan Honof",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Mentorship as an Onramp to Open Source Contributions",
    "Description": "Investing in mentorship relationships can help to grow and sustain OSS communities. Meanwhile, mentees can benefit from a sense of belonging, alongside technical learning and professional development. Join us for a conversation about four mentorship initiatives serving as onramps to open source, especially for those minoritized in tech. We’ll discuss how these collaborations have been beneficial to everyone involved, and how such efforts can be beneficial to you as a potential mentor, maintainer, or mentee.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Tyler Menezes, Kendall Nelson, Emily Lovell, Kevin Wang",
    "Topic": "General"
  },
  {
    "Name": "Linux Virtualization Based Security (LVBS)",
    "Description": "With the number of Linux kernel vulnerabilities rising, prioritizing security is essential. While the kernel offers many built-in self protection mechanisms, some gaps remain. We propose Linux Virtualization Based Security (LVBS), a security feature that can a) harden the kernel and b) ensure that critical kernel resources remain untampered, even if the kernel gets compromised. VBS uses virtualization and the hypervisor to create a more privileged, isolated virtual environment, called Virtual Trust Level 1 (VTL1). VTL1 has its own kernel where a number of security solutions are hosted.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Angelina Vu",
    "Topic": "Kernel & Low Level Systems"
  },
  {
    "Name": "Evolving AI Research Infrastructure with Kubernetes at Meta: Overcoming Challenges and Lessons Learned",
    "Description": "We migrated our Slurm based AI research infrastructure to Kubernetes, focusing on a seamless user experience. This required innovative solutions for managing complex systems, including provisioning, authentication, access control, and host management. We leveraged Kubernetes features to build a scalable and flexible infrastructure, and developed new approaches to configuration management. Join us to learn about our journey and the lessons we learned along the way.",
    "Location": "Room 106",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Shaun Hopper, Chandan Avdhut",
    "Topic": "Systems & Infrastructure"
  },
  {
    "Name": "Redefining Observability: Observability 3.0",
    "Description": "You've heard of observability, the the three pillars, and maybe even observability 1.0 vs 2.0. But, something's still missing. Our approach to observability is so technical it can miss the real value: a process through which one develops the ability to ask meaningful questions, get useful answers, and act effectively on what you learnIn an era of tight budgets and being stretched thin, executing an observability strategy that delivers meaningful impact can feel impossible. In this talk, we'll learn how to cross the chasm from theory into delivering value where it matters",
    "Location": "Room 107",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Hazel Weakly",
    "Topic": "Observability"
  },
  {
    "Name": "Unpacking Git",
    "Description": "Git is a tool used by millions every day and a core part of any software development workflow. But how does it really work? How does Git actually transfer data to the server? How does it track changes and stores all the data and versions? In this talk, we’ll take you on a journey through Git’s internals and protocols, sharing what we’ve learned about how Git transfers data over HTTPS, optimizes for storage and speed, and what it’s like to manage a Git server yourself.",
    "Location": "Room 211",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Tanja Ulianova, Nick Lewis",
    "Topic": "Developer"
  },
  {
    "Name": "Can you have the cake and eat it too? Fast and cheap observability",
    "Description": "With explosive growth of data and micro services, Observability has become expensive, complicated, and slow. This talks explores why it's expensive and has become hard to debug issues quickly. This talk explores both the legacy and state of the art approaches to handle cost, and performance in observability systems. It also explains why this is complicated to get it right, why people end up choosing one over the other. Finally, explores with all the recent innovations, if we can achieve both fast and cheap observability.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Kiran Gollu",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Affording your AI chatbot friends",
    "Description": "AI chatbots are cool, but they are O(money) expensive or potentially run on some provider’s hardware with no real agency as to how and when things change. Today we’re going to learn how to design your own personal AI agent without breaking the bank and while retaining control of every part of the stack.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-08T17:00:00-08:00",
    "EndTime": "2025-03-08T18:00:00-08:00",
    "Speakers": "Xe iaso",
    "Topic": "Open Source AI"
  },
  {
    "Name": "Barbie's Journey: A CI/CD Tale of Transformation",
    "Description": "Barbie movie serves as a compelling analogy for understanding CI/CD in software development. Through a structured analysis of key plot points, attendees will gain a deeper understanding of CI/CD concepts and their practical applications in real-world scenarios.",
    "Location": "Room 211",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "Autumn Nash",
    "Topic": "Developer"
  },
  {
    "Name": "Managing Vendor Incidents",
    "Description": "Recognizing, troubleshooting, and remediating incidents on the services your team owns and runs is hard enough; when the incident is actually happening to an upstream vendor, what can you do? This session will discuss how to plan for vendor incidents, and what to have on hand when someone else is having a very bad day.",
    "Location": "Room 106",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "Mandi Walls",
    "Topic": "Systems & Infrastructure"
  },
  {
    "Name": "Know your data: The stats behind your alerts",
    "Description": "Come get refreshed on the impact some basic choices in statistical behavior can have on what gets triggered. Learn why a median might be the choice for historical anomaly or sudden change. Jump into Gaussian distributions, data alignment challenges and the trouble with sampling. Walk out with a deeper understanding of your metrics and what they might tell you.",
    "Location": "Room 107",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "Dave McAllister",
    "Topic": "Observability"
  },
  {
    "Name": "Securing Web Applications Against OWASP Top 10 Threats in AWS Cloud",
    "Description": "Securing web applications against OWASP Top 10 threats doesn’t always require modifying the source code. This session demonstrates how AWS-native services can help prevent exploitation of vulnerabilities like Injection, Broken Access Control, Cryptographic Failures, and Server-Side Request Forgery. Learn to apply multi-layered defenses, automate compliance, tighten the attack surface, and reduce potential attack vectors. This talk, designed for those with solid AppSec and AWS knowledge, will address how these strategies align with security frameworks and cloud-native best practices.",
    "Location": "Room 101",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "Murat Aydemir",
    "Topic": "Security"
  },
  {
    "Name": "Demystifying Building Natural Language Processing ML Models and How to Leverage Them By Example",
    "Description": "This session describes and simplifies the process of building NLP models by guiding attendees through creating a basic model, followed by a more advanced redaction model from scratch. The session offers practical insights into model development, including dataset preparation and model training, while providing code to build and implement the models discussed. By the end of the session, participants will walk away with a proven framework for approaching NLP problems and the tools to apply these concepts immediately in their work.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "David vonThenen",
    "Topic": "Open Source AI"
  },
  {
    "Name": "Port Forwarding Risks When Self Hosting",
    "Description": "While useful for enabling external access to services within a private network, poses significant security risks and potential complications. By opening specific ports on a router, users expose their internal network to threats such as unauthorized access and cyberattacks, as attackers often scan for open ports to exploit vulnerabilities. misconfigurations during the setup process can lead to further security breaches and network instability. With the availability of safer alternatives like Virtual Private Networks (VPNs) and cloud services, the need for port forwarding diminishes.",
    "Location": "Room 105",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "Sam Hanna",
    "Topic": "FOSS @ HOME"
  },
  {
    "Name": "Dancing with the Pods: Live migration of a database fleet while serving millions of queries",
    "Description": "ClickHouse recently undertook a major refactoring of our operator to change how we orchestrate customer-provisioned databases through Kubernetes StatefulSets. The challenge? Migrating thousands of services to the new orchestration system without any downtime. This talk explores how we accomplished this migration, diving into the complex challenges we faced and solved. We'll cover our custom migration controller, durable execution workflows, and database synchronization hurdles that emerged while keeping ClickHouse Cloud's fleet running smoothly.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "Jayme Bird, Manish Gill",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Scaling Your Kubernetes Clusters Without Going Broke",
    "Description": "In this talk, we will discuss Karpenter's various capabilities to provide just-in-time provisioning for the resources you need. We will also show you how flexible provisioning can be, allowing you to take advantage of a wide array of instance types and architecture while optimizing cost by utilizing features of your cloud provider, such as reserved and spot instances. This talk will focus on sharing our experiences and explaining how we leveraged Karpenter to provision thousands of nodes for burst traffic while dramatically reducing our cloud spend.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "Joe Allen",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Crash Course in Open Source Generative AI",
    "Description": "This session offers a rapid introduction to deploying generative AI (GenAI) with open source tools tailored for business. Attendees will explore key projects like Enterprise GPT, an open source alternative to proprietary models, gaining practical insights for using GenAI in content creation, search, and analytics. With a focus on collaboration within the open source community, participants will leave equipped to leverage GenAI’s potential and implement customizable, enterprise-ready solutions.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "Mark Hinkle",
    "Topic": "General"
  },
  {
    "Name": "Solving Engineering Problems Using Multi GPU Computing",
    "Description": "Wait, so you're saying adding more GPUs to a problem won't automatically speed things up? In this talk, I will present how enterprise datacenters, HPC shops, and home lab workflows can benefit from using multi GPU computing. Examples from computational fluid dynamics and AI/ML will highlight how leveraging multiple GPUs can reduce time to solution, and improve scalability for large, multidimensional domains. Attendees will gain insights into science's interest in GPU computing, problem decomposition, scaling to multiple GPUs, and code optimization with multiple GPUs in mind.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "Paul Mekhedjian",
    "Topic": "General"
  },
  {
    "Name": "A deep dive into Linux Networking",
    "Description": "Linux networking is multi-component, complex and hard to undestand. This session explains the internals of Linux networking by following the lifetime of a packet recieving and sending. The session will expain the fundamental concepts of Linux networking and will explains the role of the NIC drivers, packet buffers , IRQ handlers and how they interact with the Linux network stack and the userspace programs. The session aims to help Linux engineeers understand and make the right decisions with respect to Linux Networking",
    "Location": "Ballroom C",
    "StartTime": "2025-03-08T18:15:00-08:00",
    "EndTime": "2025-03-08T19:15:00-08:00",
    "Speakers": "Mohamed Elsakhawy",
    "Topic": "Kernel & Low Level Systems"
  },
  {
    "Name": "After Conference Chinese Tea Party (Offsite)",
    "Description": "Chinese gongfu tea after-party Location: Lunasia Dim Sum House 239 E Colorado Blvd Pasadena, CA 91101 626.793.8822 We will be upstairs, from 6:30 to 8pm. Come, drink tea, and order yourself some dimsum to wash it down!",
    "Location": "Room 208",
    "StartTime": "2025-03-08T18:30:00-08:00",
    "EndTime": "2025-03-08T20:00:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Project ELevate from AlmaLinux - allowing you to upgrade in place",
    "Description": "Upgrading between major versions of CentOS Linux was always a pain, and required tons of manual labor. Project ELevate is an open source upgrade tool that allows you to move between major versions of many of the most popular RHEL-equivalent operating systems without the tedium of moving your content! Come talk to the maintainers of this project, learn how you can use it in your environment, and discuss ideas for improving it! https://almalinux.org/elevate/",
    "Location": "Ballroom G",
    "StartTime": "2025-03-08T19:30:00-08:00",
    "EndTime": "2025-03-08T20:30:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Open Sourcing Hollywood -- Can open source principles be used to harness the power of community and take over the movie business",
    "Description": "Legion M is a fan-owned movie studio owned by a community of over 54,000 investors that has produced movies with the likes of Morgan Freeman, Ed Harris, Sonequa Martin-Green, Natalie Morales, Sean Astin and Ali Larter. Co-founder Jeff Annison is at SCALE and would love to talk with members of the FLOSS community with ideas ando/or interest in applying open-source principles and best practices to the art of creating and releasing movies & TV.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-08T19:30:00-08:00",
    "EndTime": "2025-03-08T20:30:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Time Stuff: Network Time Foundation, NTP, LinuxPTP, Khronos",
    "Description": "A quick NTF Projects update, general Q/A and discussion about NTP, PTP, et al. Probably some war stories.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-08T19:30:00-08:00",
    "EndTime": "2025-03-08T20:30:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "Leveraging the political moment to help people move off big corporate platforms",
    "Description": "Let's compare notes on experiences with and resources for helping friends and colleagues degoogle and switch away from Meta, Amazon, etc. This will not be a political discussion or debate, but rather a practical meeting focused on ideas and actions that may be more feasible in this political moment. To feel more empowered to speak and act by reducing the data they inadvertently share and reducing paid subscriptions to big corporations. Participants at all levels of knowledge and technical skill are welcome.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-08T21:00:00-08:00",
    "EndTime": "2025-03-08T22:00:00-08:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "International Women's Day Fun Walk (Offsite)",
    "Description": "Join us for a fun walk through Pasadena on a lovely Saturday morning as we celebrate International Women's Day. Meet: in front of the main entrance to the Pasadena Convention Center Introductions. Stretch. Then we go. You will be led by a seasoned runner (who actually founded & currently organizes a run club in Los Angeles). Expect to be back at our starting location shortly after 9am.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-09T08:00:00-07:00",
    "EndTime": "2025-03-09T09:00:00-07:00",
    "Speakers": "",
    "Topic": "BoFs"
  },
  {
    "Name": "A Hands-On Introduction to Blender + Python",
    "Description": "As a follow-up to my SCaLE 21x FOSS @Home presentation, Creating Terrain Models with Python, Blender, and Second Life, for 22x I will lead a hands-on workshop where people can learn the basics of Blender and how to use Blender's Python API (and embedded interpreter) to create and manipulate 3D graphics at the level of code. Attendees should ideally come with the latest version of Blender already installed on their computers (just to save time). Some basic familiarity with Python or programming in general is recommended, but not required.",
    "Location": "Room 209",
    "StartTime": "2025-03-09T09:30:00-07:00",
    "EndTime": "2025-03-09T11:00:00-07:00",
    "Speakers": "Erik Mondrian",
    "Topic": "LibreGraphics"
  },
  {
    "Name": "Linux Training Class - Day 2",
    "Description": "Linux is a robust and secure operating system with a rich array of applications. SCALE is once again providing those who want to start using Linux an opportunity to learn how. SCALE will provide an installfest plus basic system administration class to help you hit the ground running with Linux. The class will be offered as an Installfest on Saturday, morning March 8, and a full day of training on Sunday 9th. Advanced registration is required.",
    "Location": "Room 208",
    "StartTime": "2025-03-09T09:30:00-07:00",
    "EndTime": "2025-03-09T16:30:00-07:00",
    "Speakers": "Tom King",
    "Topic": "Workshops"
  },
  {
    "Name": "Candidate Experience Done Right: Practical Strategies for Open Source Hiring Teams",
    "Description": "Delve into the often-overlooked aspect of open source hiring: the candidate experience. Discover how open source companies can elevate candidate experience to drive reputation, community advocacy, and future hires. This talk covers key strategies in automation, transparency, and policy, giving hiring teams actionable steps to create a standout candidate experience.",
    "Location": "Room 103",
    "StartTime": "2025-03-09T10:00:00-07:00",
    "EndTime": "2025-03-09T11:00:00-07:00",
    "Speakers": "Mary Kypreos",
    "Topic": "Career Day"
  },
  {
    "Name": "Workshop: Improve your resume and interview skills by experiencing the interviewers perspective",
    "Description": "Every wonder what you and your resume look like to interviewers? Want to see tech interviews from the other side of the desk? Senior engineering leaders are coordinating this workshop that will get you feedback from your peers about your resume and an interview, as well as give you a chance to be the interviewer for several of your peers. Learn what an interview sees and how well your resume represents you and your skills.",
    "Location": "Room 104",
    "StartTime": "2025-03-09T10:00:00-07:00",
    "EndTime": "2025-03-09T12:00:00-07:00",
    "Speakers": "Jenson Crawford",
    "Topic": "Career Day"
  },
  {
    "Name": "What happens when hardware puts software freedom first? We built a router to find out",
    "Description": "From phones to TVs to wireless routers, our lives are increasingly defined by how device makers design the devices on which we rely. But who do these devices really serve? And why can't we fix them so they serve us instead?",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-09T10:30:00-07:00",
    "EndTime": "2025-03-09T11:30:00-07:00",
    "Speakers": "Denver Gingerich",
    "Topic": "Keynote"
  },
  {
    "Name": "How to make video game vegetation sway",
    "Description": "When plants move around in video games, it adds atmosphere, wether a gentle breeze or gale force winds. We will walk through some methods to create and animate grass and trees, using all open source software such as the Godot game engine, Blender, Gimp, and Krita. In this workshop, there will be a bit of texturing, a bit of simple mesh modeling, and a bit of mostly simple shader coding!",
    "Location": "Room 209",
    "StartTime": "2025-03-09T11:00:00-07:00",
    "EndTime": "2025-03-09T12:30:00-07:00",
    "Speakers": "Tom Lechner",
    "Topic": "LibreGraphics"
  },
  {
    "Name": "Why You Should Join a Community",
    "Description": "Contributing to an Open Source community is both challenging and rewarding but worth it!",
    "Location": "Room 103",
    "StartTime": "2025-03-09T11:00:00-07:00",
    "EndTime": "2025-03-09T12:00:00-07:00",
    "Speakers": "Amy Marrich",
    "Topic": "Career Day"
  },
  {
    "Name": "Online Payments: Attack and Defense",
    "Description": "Uncover the risks of online payment processing and how to safeguard against them. Understand what motivates cyber criminals across three major attack types and learn effective strategies for detection and mitigation.",
    "Location": "Room 101",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Vincent Sloan",
    "Topic": "Security"
  },
  {
    "Name": "Reimagined Engineering Docs with Runme.dev",
    "Description": "In today’s world, we have advanced tools for testing and deploying apps, but internal engineering documentation is stuck in outdated practices like copy-pasting from wikis. Runme (runme.dev) rethinks documentation by turning Markdown into interactive Notebooks, using DevContainers for reliable dependencies, typed .ENV files for managing config/secrets, and cloud-native integrations. In just minutes, engineers can create interactive, testable docs that streamline processes and improve efficiency across teams.",
    "Location": "Room 211",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Adam Christian",
    "Topic": "Developer"
  },
  {
    "Name": "Kanister.io: Application Consistent Backups on Kubernetes",
    "Description": "Modern cloud applications and platforms make it easy to use multiple data services and tools resulting in wide range of deployments, services and data stores within an organization.This poses a challenge for data protection and disaster recovery because all those tools have their own mechanisms, datastores and recommendations for backup and restore.In this talk we're going to learn how to use K8s tools to organize data protection processes and make day2 operations easier using CNCF project Kanister.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Daniil Fedotov",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Open Source for Real-Time Voice Understanding: An Edge AI Solution",
    "Description": "This talk presents the architecture and implementation of a real-time voice understanding system for retail environments, powered by open source AI technologies and deployed on NVIDIA Jetson devices. The system integrates automatic speech recognition (ASR) and large language models (LLMs) to process customer interactions in real-time, enabling conversation understanding, summarization, and sentiment analysis. We will explore system architecture design, selection and evaluation of ASR and LLM models, design trade-offs between latency and accuracy, and share performance test results.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Zubair Talib",
    "Topic": "Open Source AI"
  },
  {
    "Name": "Controlling Robots like NASA",
    "Description": "It started with a product listing for a four-wheeled device that looked like a fun weekend project. Before long, upgrades made our robot aware of its environment and much more fun to control. In this talk, attendees can expect to learn the abbreviated version of everything we learned not to do when it comes to building and controlling remotely operated vehicles. We'll dive into the hardware side of things, talk about protocol-driven development, why memory and garbage collection are crucial and how we made all parts work together, reliably.",
    "Location": "Room 105",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Adrian Todorov, Kerim Satirli",
    "Topic": "FOSS @ HOME"
  },
  {
    "Name": "Deploying AI/ML Pipelines at Crexi",
    "Description": "Right now, there is a tremendous demand for AI ML solutions. The tasks of training and deploying open source AI models and then scaling inference have become crucial to business needs. Even though the underlying libraries are maturing rapidly, MLOps solutions have a long way to go. In this presentation, Crexi (Commercial Real Estate Exchange, Inc.) reveals how it achieved its business objectives with a powerful and flexible pipeline and model deployment solution, using open source tools to deploy open source models in AWS.",
    "Location": "Room 106",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Xpaul Vigil, Isaac Smothers",
    "Topic": "Systems & Infrastructure"
  },
  {
    "Name": "Prepare to Perform with Backstage Software Templates",
    "Description": "Backstage Software Templates provide a consistent way for platform engineers to enable self-service delivery of cloud-native software components. Templates ease onboarding and daily development work by establishing the tools, services, documentation, and best practices as “golden paths” for users to navigate. Attendees will learn how to use Backstage Software Templates to simplify access to Helm Charts, Tekton Pipelines, Kubernetes, ArgoCD, and more. Review common workflows for delivering and updating your software via the Backstage Software Catalog in this interactive session.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Ryan Jarvinen",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Copyleft and the GPL: Finding the Path Forward to Defend our Software Right to Repair",
    "Description": "Have ever wondered how FOSS was actually was supposed stay FOSS for the long term? Have you ever been unsure or confused why — in a world where Linux is on nearly every device — most people cannot actually run an alternative OS build on their device? This talk will leave you informed on these questions and prepared to participate in the next policy steps our community must take to bring back software freedom and rights to the next generation of FOSS users, activists and developers.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Bradley Kuhn",
    "Topic": "General"
  },
  {
    "Name": "Towards improving code integrity on Linux",
    "Description": "We present a recipe for improving the code integrity of a container host based on Azure Linux, at scale on Microsoft Azure. From the perspective of a cloud provider, there is a serious need to protect the integrity of a container host runtime from its tenant container workloads that require privileged access while not sacrificing performance or serviceability requirements. One of the important ingredients is the Integrity Policy Enforcement (IPE) Linux Security Module developed at Microsoft and accepted into the upstream Linux Kernel Version 6.10.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Sriram Nambakam",
    "Topic": "Kernel & Low Level Systems"
  },
  {
    "Name": "An Introduction to Post-Quantum Cryptography for Linux System Administrators",
    "Description": "This talk is for Linux system administrators looking to understand and prepare for the impacts of post-quantum computing.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Atom Ramirez, Marie Ramirez",
    "Topic": "General"
  },
  {
    "Name": "Scaling Observability with Loki at Dropbox",
    "Description": "Dropbox’s observability journey showcases the transformation from individual server log-ins to a centralized, open-source solution. In this talk, we’ll explore the deployment of Loki and integration with Grafana to manage terabytes of log data daily. I’ll discuss scaling techniques, optimizing query performance, and unifying logs and metrics to streamline troubleshooting and enhance security.",
    "Location": "Room 107",
    "StartTime": "2025-03-09T11:45:00-07:00",
    "EndTime": "2025-03-09T12:45:00-07:00",
    "Speakers": "Alok Ranjan, Paul Shen",
    "Topic": "Observability"
  },
  {
    "Name": "Make Your Open Source Story Work for You",
    "Description": "Open source is known as the remarkable collaboration of passionate minds coming together to share tech ideas and solutions for the good of the world. Yet ideally the benefit of open source collaboration is a two-way street. Join us as we look at ways to translate what we do in open source into resume-worthy skills.",
    "Location": "Room 103",
    "StartTime": "2025-03-09T12:00:00-07:00",
    "EndTime": "2025-03-09T13:00:00-07:00",
    "Speakers": "Krista Burdine",
    "Topic": "Career Day"
  },
  {
    "Name": "Career Workshop: Interviews and Negotiations in Open Source",
    "Description": "This workshop will address the toughest issues. Do you freeze up during interviews? How do you know when a job offer is the right one? What do you do if you have been out of work for a long time? Need help understanding how to negotiate? This training is in a group environment to offer maximum support and feedback.",
    "Location": "Room 104",
    "StartTime": "2025-03-09T13:00:00-07:00",
    "EndTime": "2025-03-09T15:00:00-07:00",
    "Speakers": "Jenson Crawford",
    "Topic": "Career Day"
  },
  {
    "Name": "Using Certification to Prove Home Lab Skills",
    "Description": "Adrianna Frick, head of Credentialing and Curriculum for Canonical, will discuss the importance of technical certification to the open source community, while providing information on how technical certification programs are developed. Learn how to spot the difference between certificates, certifications, and skill builders, understand the characteristics of a reputable program, and learn how to create your personal path to success.",
    "Location": "Room 103",
    "StartTime": "2025-03-09T13:00:00-07:00",
    "EndTime": "2025-03-09T14:00:00-07:00",
    "Speakers": "Adrianna Frick",
    "Topic": "Career Day"
  },
  {
    "Name": "darktable: the fundamentals, advanced techniques, and discussion",
    "Description": "We'll cover the basics in darktable for new users: importing files, filtering, tagging and management, and achieving a basic, neutral edit. We'll then transition to more advanced techniques, such as color grading, masking, luminance control, highlight reconstruction, and denoising. For maximum impact, please have darktable installed on your laptop (https://www.darktable.org/install/) and any raw files you've captured and want to edit.",
    "Location": "Room 209",
    "StartTime": "2025-03-09T13:30:00-07:00",
    "EndTime": "2025-03-09T15:00:00-07:00",
    "Speakers": "Mica Semrick",
    "Topic": "LibreGraphics"
  },
  {
    "Name": "Meet COSMIC DE",
    "Description": "By the time of this talk COSMIC has been released! Probably! Learn why System76 made COSMIC, experience its unique features, and see what you can build with COSMIC.",
    "Location": "Ballroom H",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "Carl Richell",
    "Topic": "General"
  },
  {
    "Name": "RamaLama making AI Boring",
    "Description": "This talk will present the RamaLama AI tool. It will demonstrate it and explain all of its many features.",
    "Location": "Ballroom G",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "James Huang",
    "Topic": "General"
  },
  {
    "Name": "From Pull Request to Live Environment: Automating Ephemeral Environments",
    "Description": "Static environments like staging, qa and dev are major bottlenecks in microservices architecture which slow down the development process. In this talk, we present a tool we've developed and use at GoodRx that automatically creates ephemeral environments from GitHub pull requests managed directly by a comment block in the pull request. This enables developers to quickly test, share and get feedback on their changes in isolated, disposable environments. We will share our journey in building this tool, discuss its integration with existing workflows and its future.",
    "Location": "Ballroom B",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "Vahan Melikyan",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Cloud Development Environments Are Strategic Assets",
    "Description": "Many organizations have adopted the cloud for software deployment but still rely on local machines for development. A Cloud Development Environment (CDE) is now essential. This talk explores deploying a secure, scalable CDE that enhances performance and developer experience. Key focus areas include automation, self-service, efficiency, and fostering collaboration. Attendees will learn how to leverage cloud-native technologies, justify costs, and ensure long-term innovation, reducing time-to-market and boosting competitiveness.",
    "Location": "Room 211",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "Tim Quinlan",
    "Topic": "Developer"
  },
  {
    "Name": "Beyond Sequential: A Recipe for Async Pipeline Observability and Alerting",
    "Description": "While implementing observability for thousands of microservices, we faced challenges with asynchronous pipelines that weren't covered by traditional API-based SLO approaches. This talk presents our company's journey in implementing SLOs for async systems: identifying key customer experience KPIs, leveraging Prometheus, defining good/valid events, and establishing burn rate alert thresholds. We'll share real case studies demonstrating the impact, including how we detected and resolved pipeline latency issues that affected thousands of events, along with best practices and lessons learned",
    "Location": "Room 107",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "Jash Mistry, Gabriela Medvetska",
    "Topic": "Observability"
  },
  {
    "Name": "An Opinionated Proposal to Improve Internet TLS Certificate Management: Burn It All Down",
    "Description": "The current system of public TLS certificate management suffers multiple issues, from the merely annoying to the truly grievous. While it might have been good enough to get by in the \"rough consensus and running code\" days of the Web, it's past time to take a hard look at the system that we all grudgingly tolerate, understand where and why it falls short, and begin envisioning and working toward its long-overdue replacement.",
    "Location": "Ballroom A",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "Joe Thompson",
    "Topic": "Cloud Native"
  },
  {
    "Name": "Everything I Need to Know About LLM, I Learned From A Pasadena Search Company 24 Years Ago",
    "Description": "I worked at GoTo.com/Overture/Yahoo in Pasadena 24 years ago, we were doing Big Data when it was called just data. Information Retrieval used all the sexy ML/LLM/AI concepts you hear about now. I'll discuss the parallels and extrapolate on what's next for LLM, based on what happened with Search.",
    "Location": "Ballroom F",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "Gene Chuang",
    "Topic": "Open Source AI"
  },
  {
    "Name": "Beyond Replication: A Holistic Approach to Application Scaling",
    "Description": "Over the past 3 years I have evaluated the scaling capabilities of various applications. I will share my learnings about application performance, enabling you to understand and scale your applications effectively. Attendees will learn how to: - Proactively prepare for gradual and abrupt system stress - Assess and confirm their application’s scaling potential - Identify performance bottlenecks - Implement modifications efficiently - Eliminate blind spots in stress testing and scalability validation",
    "Location": "Room 106",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "Josh Thornton",
    "Topic": "Systems & Infrastructure"
  },
  {
    "Name": "Nextcloud as A Self-Hosted Cross-Platform Cloud",
    "Description": "Using someone else's cloud to sync photos, calendars and contacts? Proprietary services like iCloud are convenient, but only if you are in the Apple ecosystem. You can get many of the same basic cloud features in a self-hosted Nextcloud instance and sync files, calendars, and contacts on Linux, Mac and mobile devices. This talk discusses how to set up Nextcloud and configure Linux and Mac desktops and iOS mobile devices to use it, especially convenient if your household isn't 100% Linux (or 100% Mac).",
    "Location": "Room 105",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "Kyle Rankin",
    "Topic": "FOSS @ HOME"
  },
  {
    "Name": "Bringing Per-CPU Variables to Rust-for-Linux",
    "Description": "Per-CPU variables are widely used in the Linux kernel to reduce contention of atomics and locks in large scale systems. This makes them an attractive API to use from Rust, but exposing this API requires interacting with all levels of the kernel stack: from the build system and linker all the way to arch-specific optimizations and runtime allocation of new per-CPU variables. This talk is intended for an audience that is broadly familiar with kernel primatives and synchronization issues but entirely new to Rust.",
    "Location": "Ballroom C",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "Mitchell Levy",
    "Topic": "Kernel & Low Level Systems"
  },
  {
    "Name": "Defense in Depth, as learned from watching football",
    "Description": "Just as a well-coordinated football defense protects a team from scoring, a robust application security strategy safeguards digital assets from cyberattacks. Football teams have the ultimate defense in depth strategy that can be studied to build a stronger application security program. By understanding the parallels between maintaining secure code and football defense, developers can continue to create and maintain secure open source software. No prior knowledge about football or application security is required.",
    "Location": "Room 101",
    "StartTime": "2025-03-09T13:45:00-07:00",
    "EndTime": "2025-03-09T14:45:00-07:00",
    "Speakers": "Kennedy Toomey",
    "Topic": "Security"
  },
  {
    "Name": "How to crack software engineering interviews at FAANG and beyond",
    "Description": "Cracking the FAANG interviews. This session would cover coding, system design, and behavioral, such as leveraging previous work experiences and life experiences to demonstrate qualities that most of these companies seek. I'd provide samples from my own interviewing experience at companies like Google, Amazong, Netflix, Microsoft, etc.",
    "Location": "Room 103",
    "StartTime": "2025-03-09T14:00:00-07:00",
    "EndTime": "2025-03-09T15:00:00-07:00",
    "Speakers": "Vinit Dhatrak",
    "Topic": "Career Day"
  },
  {
    "Name": "Closing Keynote with Leslie Lamport",
    "Description": "Join us for a captivating closing keynote with the legendary Leslie Lamport, Turing Award winner and pioneer in the field of distributed computing. We'll discuss computing history, open source and distributed systems.",
    "Location": "Ballroom DE",
    "StartTime": "2025-03-09T15:00:00-07:00",
    "EndTime": "2025-03-09T16:00:00-07:00",
    "Speakers": "Leslie Lamport",
    "Topic": "Keynote"
  }
]
